//===============Ž¯¨á ­¨¥ à¥£¨áâà®¢ ¯ ¬ïâ¨ ®¡¬¥­ . â¨¯: Unsigned Int===================
//
//| ­®¬¥à  à¥£¨áâà®¢ | ­®¬¥à  ïç¥¥ª ¬ áá¨¢  à¥£¨áâà®¢ | á®¤¥à¦ ­¨¥ à¥£¨áâà  | ®¯¨á ­¨¥|
//
//  ü | Share_Mem[ü] | á®¤¥à¦ ­¨¥ | ------------Ž¯¨á ­¨¥-------------------------------
//  1		0   		R_Quants,				à¥£¨áâà á®áâ®ï­¨ï ¯à®æ¥áá®¢
//  2   	1   		B_ac_TIC,			    €­ «®£®¢ë© á¨£­ « á TIC (®¡®à®âë ’Œ)
//  3   	2   		ac_APG,     			„ ¢«¥­¨¥ á ¢ ªãã¬¥âà  APG
//  4   	3  		 	ac_WRG,    				„ ¢«¥­¨¥ á ¢ ªãã¬¥âà  WRG
//  5   	4   		ac_MFC1,      			®â®ª £ §®­ â¥ª ­¨ï ç¥à¥§ ƒ1 
//  6   	5   		ac_MFC2,    			®â®ª £ §®­ â¥ª ­¨ï ç¥à¥§ ƒ2
//  7   	6   		ac_CVM,                 „ ¢«¥­¨¥ á ¢ ªãã¬¥âà  CVM
//  8   	7   		ac_7					¥ ¨á¯®«ì§ã¥âáï
//  9   	8   		ac_8					¥ ¨á¯®«ì§ã¥âáï
//                                              ¥§¥à¢
//  14  	13      	com_rx					¥£¨áâà-¡ãä¥à ¯à¨­ïâëå ¤ ­­ëå ç¥à¥§ COM-¯®àâ
//  16		15			rg_dc		 			¥£¨áâà á¨£­ «®¢ „Š
//  18		17			err_code				ãä¥à ®è¨¡®ª 
//          			       					¥§¥à¢
//  21  	20  								‘®áâ®ï­¨¥ æ¨ª«  § ¯¨á¨/çâ¥­¨ï (¥á«¨ !=0 â®
//												¡ë«® ®¡à é¥­¨¥ ª«¨¥­â  => ®¡­®¢«ï¥¬ á¥à¢¥à)
//  22  	21  								®¬¥à ª®¬ ­¤ë ¤«ï ¨á¯®«­¥­¨ï
//  23		22									 à ¬¥âà ª®¬ ­¤ë
//  24		23			au_MFC1					‡ ¤ ­¨¥ ¯®â®ª  £ §®­ â¥ª ­¨ï ç¥à¥§ ƒ1
//  25		24			au_MFC2					‡ ¤ ­¨¥ ¯®â®ª  £ §®­ â¥ª ­¨ï ç¥à¥§ ƒ2
//  26  	25      	au_Shd_speed            áª®à®áâì ¢à é¥­¨ï ˜„
//  27  	26      	au_Shd_accel            ãáª®à¥­¨¥ ¢à é¥­¨ï ˜„
//  28		27			rg_du	         		¥£¨áâà „“
//  29		28			au_servo1               ¯®«®¦¥­¨¥ á¥à¢®¯à¨¢®¤  § á«®­ª¨
//  30		29			au_servo2               ¯®«®¦¥­¨¥ á¥à¢®¯à¨¢®¤  ¤à®áá¥«¨à®¢ ­¨ï
//------------------------------------------------------------------------------------
//
//===============‘®¤¥à¦ ­¨¥ ¯à®æ¥áá®¢ ¢ à¥£¨áâà¥ á®áâ®ï­¨ï ¯à®æ¥áá®¢ ü1===============
//
// ­®¬¥à ¡¨â  | ¯à®æ¥áá	--------------------------------------------------------------
//		1		”‚ ®âª çª 
//		2		‚‚ ®âª çª 
//		3		à §£®­ ’Œ
//		4		â®à¬®¦¥­¨¥ ’Œ
//		5		­ ¯ãáª £ §  ç¥à¥§ ƒ1
//		6		­ ¯ãáª £ §  ç¥à¥§ ƒ2
//		7		¯à®¤ã¢ £ §®¢®© «¨­¥©ª¨
//		8		®â¯à ¢ª  á¨¬¢®«®¢ ç¥à¥§ COM-¯®àâ 1
//------------------------------------------------------------------------------------
//
//===============Ž¯¨á ­¨¥ ª®¬ ­¤, § ¯¨á ­­ëå ¢ à¨£¨áâàë ü22 ==========================
//
// §­ ç¥­¨¥ à¥£¨áâà  22 | ¯®æ¥¤ãàë ®¡à ¡®âª¨ ª®¬ ­¤ | --Ž¯¨á ­¨¥----------------------
//			1		 		vacuum_start()				‡ ¯ãáª ¯à®æ¥áá  ®âª çª¨
//			2				vacuum_stop()				‡ ¯ãáª ¯à®æ¥áá  ®áâ ­®¢ª¨ ®âª çª¨
//			3											à®æ¥áá ­ ¯ãáª  £ §  ç¥à¥§ ƒ1
//			4				napusk_start()				à®æ¥áá ¯®áâ¥¯¥­­®£® ­ ¯ãáª  £ §  ç¥à¥§ ƒ2
//          5											Žâªàëâ¨¥/‡ ªàëâ¨¥ ª« ¯ ­®¢
//          6											ˆ§¬¥­¥­¨¥ ¯®«®¦¥­¨ï á¥à¢®¤¢¨£ â¥«ï § á«®­ª¨
//          7											ˆ§¬¥­¥­¨¥ ¯®«®¦¥­¨ï á¥à¢®¤¢¨£ â¥«ï ¤à®áá¥«¨à®¢ ­¨ï
//          51											®â¯à ¢ª  á¨¬¢®«  ç¥à¥§ COM-¯®àâ 1
//			52-57			otpravka_symvolov() 		‘ä®à¬¨à®¢ âì ¯®á«¥¤®¢ â¥«ì­®áâì ª®¬ ­¤ 
//														¤«ï ®â¯à ¢ª¨ ç¥à¥§ COM-¯®àâ 1 ­  ª®­âà®««¥à ˜„
//          52											­¥¯à¥àë¢­®¥ ¢à é¥­¨¥ è £®¢®£® ¤¢¨£ â¥«ï
//          53				SMC_reset()					®áâ ­®¢¨âì ˜„
//          54											¯¥à¥¬¥é¥­¨¥ ˜„ ¯® § ¤ ­­®© ª®®à¤¨­ â¥
//          55											¯¥à¥¬¥é¥­¨¥ ˜„ ­  § ¤ ­­®¥ ç¨á«® è £®¢ ¯® ç á®¢®©
//          56											¯¥à¥¬¥é¥­¨¥ ˜„ ­  § ¤ ­­®¥ ç¨á«® è £®¢ ¯à®â¨¢ ç á®¢®©
//          57											áª ­¨àãîé¥¥ ¤¢¨¦¥­¨¥ ˜„
//          100											§ ¢¥àè¥­¨¥ à ¡®âë ¯à®£à ¬¬ë
//          10/20										¢ª«./¢ëª«.  ¢â®¬ â¨ç¥áª®© ®âª çª¨
//          30/40										¢ª«./¢ëª«.  ¢â®¬ â¨ç¥áª®© ¯à®¤ã¢ª¨ £ §®¢®© «¨­¥©ª¨
//          1000	    	Avarya();					 ¢ à¨©­ ï ®áâ ­®¢ª  ®âª çª¨
//------------------------------------------------------------------------------------
//
//===============Ž¯¨á ­¨¥ ¯ à ¬¥âà®¢ ª®¬ ­¤, § ¯¨á ­­ëå ¢ à¨£¨áâàë ü23 ===============
//
// §­ ç¥­¨¥ à¥£¨áâà  22 | §­ ç¥­¨¥ à¥£¨áâà  23 | ---Ž¯¨á ­¨¥--------------------------
//			1					1/2					‡ ¯ãáª ”‚/’Œ
//			2					1/2					Žáâ ­®¢ ”‚/’Œ
//			5					1 - 6				­®¬¥à ª« ¯ ­ 
//			6					0 - 4379			ãáâ ­ ¢«¨¢ ¥¬®¥ §­ ç¥­¨¥ ¢ ¬‚ ­  ª ­ « €“	
//			7					0 - 4379			ãáâ ­ ¢«¨¢ ¥¬®¥ §­ ç¥­¨¥ ¢ ¬‚ ­  ª ­ « €“
//			51					?					ª®¤ ®â¯à ¢«ï¥¬®£® á¨¬¢®«  ¢ ASCII
//			52					1/2					1 - ¢à é âì ¯® ç á®¢®© 2 - ¯à®â¨¢ ç á®¢®©
//			54					0 - 800				ª®®à¤¨­ â  ¢ è £ å ®â­®á¨â¥«ì­® 0 ¯®«®¦¥­¨ï
//			55,56				0 - ?				ª®«¨ç¥áâ¢® è £®¢
//			57					?					á¥ªâ®à áª ­¨à®¢ ­¨ï ¢ £à ¤ãá å								
//------------------------------------------------------------------------------------
//
//===============‘®¤¥à¦ ­¨¥ ®è¨¡®ª ¢ ¡ãä¥à¥ ®è¨¡®ª ü18 ===============================
//
// ­®¬¥à ¡¨â  | ®¯¨á ­¨¥ ®è¨¡ª¨-------------------------------------------------------
//		1		®è¨¡ª  ¢ ªãã¬¥âà  APG (­¥ ¯®ª §ë¢ ¥â ¢¥à­ë¥ §­ ç¥­¨ï)
//		2		¤ ¢«¥­¨¥ ¯à¥¢ëè ¥â âà¡ã¥¬®¥ ¯à¨ ¯®¯ëâª¥ § ¯ãáª  ’Œ
//		3		¯«®å®© ¢ ªãã¬ (¤ ¢«¥­¨¥ WRG ¢®§à®á«® ¢ëè¥ âà¥ã¥¬®£® ¢® ¢à¥¬ï à ¡®âë ’Œ)
//		4		®è¨¡ª  ¨­¨æ «¨§ æ¨¨ â ©¬¥à  ‹Š	
//		5		®è¨¡ª  ¨­¨æ¨ «¨§ æ¨¨ COM-¯®àâ  1							
//------------------------------------------------------------------------------------

//	ˆá¯®«ì§ã¥¬ë¥ á®ªà é¥­¨ï:
//	ƒ - à¥£ã«ïâ®à  à áå®¤  £ § 
//	’Œ - âãà¡®¬®«¥ªã«ïà­ë© ­ á®á
//	”‚ - ä®à¢ ªãã¬­ë© ­ á®á
//	”‚ - ä®à¢ ªãã¬­ë©
//	‚‚ - ¢ëá®ª®¢ ªãã¬­ë©
//	˜„ - è £®¢ë© ¤¢¨£ â¥«ì
//	„Š - ¤¨áªà¥â­ë© ª®­âà®«ì
//	„“ - ¤¨áªà¥â­®¥ ã¯à ¢«¥­¨¥
//	€Š -  ­ «®£®¢ë© ª®­âà®«ì
//	€“ -  ­ «®£®¢®¥ ã¯à ¢«¥­¨¥
//	‹Š - ¯à®£à ¬¬¨àã¥¬ë© «®£¨ç¥áª¨© ª®­âà®««¥à
//	TIC - ª®­âà®««¥à ã¯à ¢«¥­¨ï í«¥¬¥­â ¬¨ á®§¤ ­¨ï ¨ ª®­âà®«ï ¢ ªãã¬ 

//	®¤ª«îç¥­¨¥ ¡¨¡«¨®â¥ª ‹Š
#include "mod.h"
#include "5510drv.h"
#include "stdlib.h"
#include "math.h"

// §¬¥à ¯ ¬ïâ¨ ®¡¬¥­  á¥à¢¥à  - 31 à¥£¨áâà
#define sizeofShareMem	31
#define NULL_MAG_DELTA 319

//===================ˆ­¨æ¨ «¨§ æ¨ï ¯¥à¥¬¥­­ëå=========================================
unsigned int		// ‘®¤¥à¦ ­¨¥
Share_Mem[sizeofShareMem],	//¯ ¬ïâì ®¡¬¥­ 
R_Quants=0,			// à¥£¨áâà á®áâ®ï­¨ï ¯à®æ¥áá®¢
rg_dc,				// à¥£¨áâà „Š
rg_du,				// à¥£¨áâà „“
command=0,			// ª®¤ ª®¬ ­¤ë
dop_command=0,		// ¤®¯®«­¨â¥«ì­ë© ª®¤ ª®¬ ­¤ë
err_code=0;			// ¡ãä¥à ®è¨¡®ª

//-------------------- ­®¬¥à  ¬®¤ã«ì­ëå á«®â®¢ ‹Š -----------------------------------
unsigned char
slot_au=0,			// ­®¬¥à á«®â  á ¬®¤ã«¥¬  ­ «®£®¢®£® ã¯à ¢«¥­¨ï;
slot_ac=1,			// ­®¬¥à á«®â  á ¬®¤ã«¥¬  ­ «®£®¢®£® ª®­âà®«ï;
slot_dc=2,			// ­®¬¥à á«®â  á ¬®¤ã«¥¬ ¤¨áªà¥â­®£® ª®­âà®«ï;
slot_du=3;  		// ­®¬¥à á«®â  á ¬®¤ã«¥¬ ¤¨áªà¥â­®£® ã¯à ¢«¥­¨ï;

//-------------------- ­®¬¥à  ª ­ «®¢ ¬®¤ã«ï €Š ‹Š ----------------------------------
unsigned int
B_ac_TIC=0,			// á¨£­ « à §£®­ ’Œ
B_ac_APG=1,   		// á¨£­ « ¤ ¢«¥­¨¥ á ¢ ªãã¬¥âà  APG
B_ac_WRG=2,			// á¨£­ « ¤ ¢«¥­¨¥ á ¢ ªãã¬¥âà  WRG
B_ac_MFC1=3,		// á¨£­ « ¯®â®ª £ §®­ â¥ª ­¨ï ç¥à¥§ ƒ1
B_ac_MFC2=4,		// á¨£­ « ¯®â®ª £ §®­ â¥ª ­¨ï ç¥à¥§ ƒ2
B_ac_CVM=5,     	// á¨£­ « ¤ ¢«¥­¨¥ á ¢ ªãã¬¥âà  CVM

//-------------------- ­®¬¥à  ª ­ «®¢ ¬®¤ã«ï €“ ‹Š ----------------------------------
B_au_MFC1=0,    	// á¨£­ « § ¤ ­¨¥ ¯®â®ª  £ §®­ â¥ª ­¨ï ç¥à¥§ ƒ1	
B_au_MFC2=1,    	// á¨£­ « § ¤ ­¨¥ ¯®â®ª  £ §®­ â¥ª ­¨ï ç¥à¥§ ƒ2
B_au_Servo1=2,  	// á¨£­ « ¯®«®¦¥­¨¥ á¥à¢®¤¢¨£ â¥«ï § á«®­ª¨
B_au_Servo2=3,  	// á¨£­ « ¯®«®¦¥­¨¥ á¥à¢®¤¢¨£ â¥«ï ¤à®áá¥«¨à®¢ ­¨ï

//-------------------- ­®¬¥à  ª ­ «®¢ ¬®¤ã«ï „Š ‹Š ----------------------------------
B_dc_Alarm_TIC=0, 	// á¨£­ « ®è¨¡ª  ª®­âà®««¥à  TIC
				
//-------------------- ­®¬¥à  ª ­ «®¢ ¬®¤ã«ï „“ ‹Š ----------------------------------
B_du_FVN_on=0,  	// á¨£­ « ¢ª«îç¨âì ”‚
B_du_TMN_on=1,		// á¨£­ « ¢ª«îç¨âì ’Œ
B_du_VE_1_on=5,		// á¨£­ « ®âªàëâì ª« ¯ ­ ü1
B_du_VE_2_on=6,		// á¨£­ « ®âªàëâì ª« ¯ ­ ü2
B_du_VE_3_on=7,		// á¨£­ « ®âªàëâì ª« ¯ ­ ü3
B_du_VE_4_on=8,		// á¨£­ « ®âªàëâì ª« ¯ ­ ü4
B_du_VE_5_on=9, 	// á¨£­ « ®âªàëâì ª« ¯ ­ ü5
B_du_VE_6_on=10,	// á¨£­ « ®âªàëâì ª« ¯ ­ ü6
B_du_SMC_reset=12,	// á¨£­ « reset ª®­âà®««¥à  ˜„
			
//-------------------- §­ ç¥­¨ï à¥£¨áâà®¢ €Š -----------------------------------------
ac_APG,				//	„ ¢«¥­¨¥ á ¢ ªãã¬¥âà  APG			
ac_WRG,				//	„ ¢«¥­¨¥ á ¢ ªãã¬¥âà  WRG
ac_CVM,         	//	„ ¢«¥­¨¥ á ¢ ªãã¬¥âà  CVM
ac_MFC1,			//	¯®â®ª £ §®­ â¥ª ­¨ï ç¥à¥§ ƒ1
ac_MFC2,			//	¯®â®ª £ §®­ â¥ª ­¨ï ç¥à¥§ ƒ2
					
//-------------------- §­ ç¥­¨ï à¥£¨áâà®¢ €“ -----------------------------------------
au_MFC1=0,			// § ¤ ­¨¥ ¯®â®ª  £ §®­ â¥ª ­¨ï ç¥à¥§ ƒ1
au_MFC2=0,			// § ¤ ­¨¥ ¯®â®ª  £ §®­ â¥ª ­¨ï ç¥à¥§ ƒ2
au_prev_MFC2=0,		// ¯à¥¤ë¤ãé¥¥ §­ ç¥­¨¥ au_MFC2 
au_Shd_speed=0,		// áª®à®áâì ¢à é¥­¨ï ˜„
au_Shd_accel=0,		// ãáª®à¥­¨¥ ¢à é¥­¨ï ˜„
au_Servo1=0,		// ¯®«®¦¥­¨¥ á¥à¢®¤¢¨£ â¥«ï § á«®­ª¨
au_Servo2=0;		// ¯®«®¦¥­¨¥ á¥à¢®¤¢¨£ â¥«ï ¤à®áá¥«¨à®¢ ­¨ï

//==========Œ áª¨ ª ­ «®¢ ¤¨áªà¥â­®£® ã¯à ¢«¥­¨ï======================================
//----------¨á¯®«ì§ãîâáï ¤«ï ¯®¡¨â®¢ëå ®¯¥à æ¨© á à¥£¨áâà ¬¨--------------------------
unsigned int
mask_on[16]=
{0x1,		//ª ­ « 0	0000 0000 0000 0001
 0x2,		//ª ­ « 1	0000 0000 0000 0010
 0x4,		//ª ­ « 2	0000 0000 0000 0100
 0x8,		//ª ­ « 3	0000 0000 0000 1000
 0x10,		//ª ­ « 4	0000 0000 0001 0000
 0x20,		//ª ­ « 5	0000 0000 0010 0000
 0x40,		//ª ­ « 6	0000 0000 0100 0000
 0x80,		//ª ­ « 7	0000 0000 1000 0000
 0x100,		//ª ­ « 8	0000 0001 0000 0000
 0x200,		//ª ­ « 9	0000 0010 0000 0000
 0x400,	    //ª ­ « 10	0000 0100 0000 0000
 0x800,	    //ª ­ « 11	0000 1000 0000 0000
 0x1000,	//ª ­ « 12	0001 0000 0000 0000
 0x2000,	//ª ­ « 13	0010 0000 0000 0000
 0x4000,	//ª ­ « 14	0100 0000 0000 0000
 0x8000,	//ª ­ « 15	1000 0000 0000 0000
 },
 mask_off[16]=
{0xfffe,	//ª ­ « 0	1111 1111 1111 1110
 0xfffd,	//ª ­ « 1	1111 1111 1111 1101
 0xfffb,	//ª ­ « 2	1111 1111 1111 1011
 0xfff7,	//ª ­ « 3	1111 1111 1111 0111
 0xffef,	//ª ­ « 4	1111 1111 1110 1111
 0xffdf,	//ª ­ « 5	1111 1111 1101 1111
 0xffbf,	//ª ­ « 6	1111 1111 1011 1111
 0xff7f,	//ª ­ « 7	1111 1111 0111 1111
 0xfeff,	//ª ­ « 8	1111 1110 1111 1111
 0xfdff,	//ª ­ « 9 	1111 1101 1111 1111
 0xfbff,	//ª ­ « 10	1111 1011 1111 1111
 0xf7ff,	//ª ­ « 11	1111 0111 1111 1111
 0xefff,	//ª ­ « 12	1110 1111 1111 1111
 0xdfff,	//ª ­ « 13	1101 1111 1111 1111
 0xbfff,	//ª ­ « 14	1011 1111 1111 1111
 0x7fff,	//ª ­ « 15	0111 1111 1111 1111
 };
					
//------------------- ¢á¯®¬ £ â¥«ì­ë¥ ¯¥à¥¬¥­­ë¥ -------------------------------------
unsigned int					
vsp_array[8],		//¢á¯®¬ £ â¥«ì­ë© ¬ áá¨¢ ¤«ï à ¡®âë á ¬®¤ã«ï¬¨ €“ ¨ €Š
v_ac,  	  			//¢á¯®¬®£ â¥«ì­ ï ¯¥à¥¬¥­­ ï ¤«ï á®áâ®ï­¨ï ª ­ «®¢ €Š
v_mask,   			//¢á¯®¬®£ â¥«ì­ ï ¬ áª 
ac_contr;			//¤«ï  ­ «®£®¢®£® ª®­âà®«ï
unsigned long
vsp_long;			//¢á¯®¬®£ â¥«ì­®¥ ¤«¨­­®¥

//------------------- ª®­áâ ­âë ¢ ªãã¬­®© ®âª çª¨ ------------------------------------
unsigned int		
//APG_st_TMN=1600, 	//„ ¢«¥­¨¥ APG âà¥¡ã¥¬®¥ ¤«ï § ¯ãáª  TMN ¢ ¤¨áªà¥â å
WRG_st_TMN=2720,    //„ ¢«¥­¨¥ WRG âà¥¡ã¥¬®¥ ¤«ï § ¯ãáª  TMN ¢ ¤¨áªà¥â å
Min_TMN_Time=300,   //Œ¨­¨¬ «ì­®¥ ¢à¥¬ï ”‚ ®âª çª¨ ¯¥à¥¤ § ¯ãáª®¬ ’Œ
P_WRG_B=2735;		//„ ¢«¥­¨¥ WRG ¯®á«¥ ®âª çª¨,
					//á¢¨¤¥â¥«ìáâ¢ãîé¥¥ ® ¯«®å®¬ ¢ ªãã¬¥ ¢ ª ¬¥à¥ ¢ ¤¨áªà¥â å

//----------------------- ä« £¨ 1/0	--------------------------------------------------
unsigned int 			//ä« £¨ 1/0
auto_vacuum_start=0,	// ¢â®¬ â¨ç¥áª¨ ¯¥à¥å®¤¨âì ­  ‚‚ ®âª çªã?
auto_produv_start=0,    // ¢â®¬ â¨ç¥áª¨ ¯à®¤ã¢ âì £ §®¢ãî «¨­¨î?
produv_state=0,         //¯à®¤ã¢ £ §®¢®© «¨­¨¨ § ¢¥àè¥­?
SHd_state=0;       		//¯®«®¦¥­¨¥ ˜„ ®¯à¥¤¥«¥­®?

//------------------- áç¥âç¨ª¨ -------------------------------------------------------
unsigned int
n1vacuum=0,     	//áç¥âç¨ª ¢à¥¬¥­¨ 1 íâ ¯  ®âª çª¨
n1produv=0;			//áç¥âç¨ª ¢à¥¬¥­¨ ¯à®¤ã¢  £ §®¢®© «¨­¨¨
unsigned char
n_vacuum=1;			//â¥ªãé¨© íâ ¯ ®âª çª¨

//------------------- ¯à®ç¥¥ ---------------------------------------------------------
unsigned int
smb_to_send=0,  	//ª®«-¢® á¨¬¢®«®¢, ª®â®àë¥ ­ ¤® ®â¯à ¢¨âì ç¥à¥§ COM-¯®àâ 1
SHd_position=0, 	//â¥ªãé ï ª®®à¤¨­ â  ˜„ ¢ è £ å ®â­®á¨â¥«ì­® 0 ¯®«®¦¥­¨ï
Shd_enable_flag =0, //ä« £ ¢ª«îç¥­¨ï â®ª  ®¡¬®â®ª ¤¢¨£ â¥«ï.
produv_time=300;	//¢à¥¬ï ¯à®¤ã¢  £ §®¢®© «¨­¨¨

//------------------- ¯¥à¥¬¥­­ë¥ ¤«ï à ¡®âë á COM-¯®àâ®¬ -----------------------------
char
text_to_send[100],	//¡ãä¥à á¨¬¢®«®¢ ¤«ï ®â¯à ¢ª¨
str[5];				//¡ãä¥à ¤«ï ¯®á¨¬¢®«ì­®© § ¯¨á¨ ç¨á¥«

//---------------------------------------- è ¡«®­ë ¯®á«¥¤®¢ â¥«ì­®áâ¥© ª®¬ ­¤ --------
//---------------------------------------- ¤«ï ®â¯à ¢ª¨ ç¥à¥§ COM-¯®àâ 1 ------------- 
char
start_left[13]="<LM>DL>SS0>AL",			
start_right[13]="<LM>DR>SS0>AL",
step_left[15]="<LM>DL>SD100>MV",
step_right[15]="<LM>DR>SD100>MV",
move_text[7]=">MV>FS>",
start_text[4]=">FS>",
speed_text[3]=">SD",
mv_text[3]=">MV",
acc_text[4]=">AL-",
scan_init[13]=">RS>LL>SS0>AL",
scan_speed[7]=">SD0>MV",
scan_start[15]=">RS>JP5>JP2>FS>",
home_text[18]="<LM>DR>SD100>HM>MV";
home_first[33]="<LM>DR>SD100>HM>DL>MV120>DR>HM>MV";

//---------------------------------------- ¯¥à¥¬¥­­ë¥ ¤«ï ¯ã«ìâ®¢®© ¯¥â«¨ ------------
enum {ACTIV, PASSIV} dispetcher;		// ¤¨á¯¥âç¥à § ¤ ç (¢ª«./¢ëª«.)
enum {PRIORY, DONUT} queue;				// ¯®á«¥¤®¢ â¥«ì­®áâì ®¡à ¡®âª¨ § ¤ ç:
										// (¯® ¯à¨®à¨â¥âã / ¯®á«¥¤®¢ â¥«ì­®)
										

//---------------------------------------- á¯¥æ¨ «ì­ë© â¨¯ "¯à®æ¥áá,ª¢ ­â"------------
typedef struct {
	int tm;						//¨­¤¥ªá ¯à¨ªà¥¯«¥­­®£® â ©¬¥à 
	enum {STOP, START} stt;		//á®áâ®ï­¨¥ ¯à®æ¥áá :STOP-®áâ ­®¢«¥­,
				}				//START - ¢ ®ç¥à¥¤¨ ­  ¨á¯®«­¥­¨¥
typ_sq;          				

//-------------------- ª¢ ­âë ¯à®æ¥áá®¢, ®¡á«ã¦¨¢ ¥¬ëå ¢ ¤¨á¯¥âç¥à¥ § ¤ ç ------------
typ_sq
q_vacuum_start,		// ¯à®æ¥áá § ¯ãáª  ¢ ªãã¬­®© ®âª çª¨
q_vacuum_stop,	    // ¯à®æ¥áá ®áâ ­®¢  ¢ ªãã¬­®© ®âª çª¨
q_napusk_start,		// ¯à®æ¥áá ¯®áâ¥¯¥­­®£® ã¢¥«¨ç¥­¨ï ¯®â®ª  £ §®­ â¥ª ­¨ï
					// ç¥à¥§ ƒ ¤® § ¤ ­­®£® §­ ç¥­¨ï
q_produv_start,		// ¯à®æ¥áá ¯à®¤ã¢  £ §®¢®© «¨­¨¨
q_com_tx,			// ¯à®æ¥áá ®â¯à ¢ª¨ á¨¬¢®«®¢ ç¥à¥§ COM-¯®àâ
q_SMC_reset;		// ¯à®æ¥áá ¯®¤ ç¨ ¨ á­ïâ¨ï á¨£­ «  á¡à®á ­  ª®­âà®««¥à ˜„

//=============== à®æ¥¤ãàë ¨ äã­ªæ¨¨ ¤«ï à ¡®âë á ª ­ « ¬¨ ¬®¤ã«¥© ‹Š ==================================

//--------------------------------€­ «®£®¢ë© ª®­âà®«ì-----------------------------------------------------
unsigned int a_cntrl(int slot_ac, int n_kanal)	//¢¢®¤¨¬ ­®¬¥à á«®â  ¨ ­®¬¥à ª ­ « 
{
	Get5017H_P1(slot_ac,n_kanal,&ac_contr);		//¯à®æ¥¤ãà  áç¨âë¢ ­¨ï ­ ¯àï¦¥­¨ï ‹Š 
	ac_contr=ac_contr&0x0FFF;					//¬®¤ã«ì ¯¥à¥¤ ¥â §­ ç¥­¨¥ ¢ 12 ¡¨â å
	return ac_contr;							//¢®§¢à é ¥¬ §­ ç¥­¨¥ ¢ ¤¨áªà¥â å
}
//--------------------------------‚ª«îç¨âì ª ­ « „“-------------------------------------------------------
void du_on(int slot, int n_kanal)				//¢¢®¤¨¬ ­®¬¥à á«®â  ¨ ­®¬¥à ª ­ « 
{
	Get5050(slot,0,AWord,&v_mask);				//áç¨âë¢ ¥¬ â¥ªãé¥¥ á®áâ®ï­¨¥ ª ­ «®¢ ¢ ¯¥à¥¬¥­­ãî v_mask
	v_mask=(v_mask)|(mask_on[n_kanal]);			//¨§¬¥­ï¥¬ §­ ç¥­¨¥ ¡¨â  ¯¥à¥¬¥­­®© ­  1 (¢ëá®ª¨© ãà®¢¥­ì)
												//(­®¬¥à ¡¨â  à ¢¥­ ­®¬¥àã ¯¥à¥ª«îç ¥¬®£® ª ­ « )
	Set5050(&v_mask,slot,0,AWord);  			//¯à®æ¥¤ãà  ãáâ ­®¢ª¨ á®áâ®ï­¨ï ª ­ «®¢ ‹Š
}
//--------------------------------‚ëª«îç¨âì ª ­ « „“------------------------------------------------------
void du_off(int slot, int n_kanal)				//¢¢®¤¨¬ ­®¬¥à á«®â  ¨ ­®¬¥à ª ­ « 
{
	Get5050(slot,0,AWord,&v_mask);				//áç¨âë¢ ¥¬ â¥ªãé¥¥ á®áâ®ï­¨¥ ª ­ «®¢ ¢ ¯¥à¥¬¥­­ãî v_mask
	v_mask=(v_mask)&(mask_off[n_kanal]);		//¨§¬¥­ï¥¬ §­ ç¥­¨¥ ¡¨â  ¯¥à¥¬¥­­®© ­  0 (­¨§ª¨© ãà®¢¥­ì)
												//(­®¬¥à ¡¨â  à ¢¥­ ­®¬¥àã ¯¥à¥ª«îç ¥¬®£® ª ­ « )
	Set5050(&v_mask,slot,0,AWord);  			//¯à®æ¥¤ãà  ãáâ ­®¢ª¨ á®áâ®ï­¨ï ª ­ «®¢ ‹Š
}
//--------------------------------ˆ­¢¥àâ¨à®¢ âì ª ­ « „“--------------------------------------------------
void du_inv(int slot, int n_kanal)				//¢¢®¤¨¬ ­®¬¥à á«®â  ¨ ­®¬¥à ª ­ « 
{
	Get5050(slot,0,AWord,&v_mask);				//áç¨âë¢ ¥¬ â¥ªãé¥¥ á®áâ®ï­¨¥ ª ­ «®¢ ¢ ¯¥à¥¬¥­­ãî v_mask
	if ((v_mask&mask_on[n_kanal])==0)			//¥á«¨ á®áâ®ï­¨¥ ¡¨â  = 0,
		v_mask=(v_mask)|(mask_on[n_kanal]);		//â® ¬¥­ï¥¬ ­  1
	else										//(­®¬¥à ¡¨â  à ¢¥­ ­®¬¥àã ¯¥à¥ª«îç ¥¬®£® ª ­ « )
		v_mask=(v_mask)&(mask_off[n_kanal]);	//¨­ ç¥ ¬¥­ï¥¬ ­  0
	   
	Set5050(&v_mask,slot,0,AWord);				//¯à®æ¥¤ãà  ãáâ ­®¢ª¨ á®áâ®ï­¨ï ª ­ «®¢ ‹Š
}
//--------------------------------à®¢¥à¨âì ª ­ « „Š------------------------------------------------------
int dc(int slot, int n_kanal)					//¢¢®¤¨¬ ­®¬¥à á«®â  ¨ ­®¬¥à ª ­ « 
{								
	Get5050(slot,0,AWord,&v_mask);				//áç¨âë¢ ¥¬ â¥ªãé¥¥ á®áâ®ï­¨¥ ª ­ «®¢ ¢ ¯¥à¥¬¥­­ãî v_mask
	return v_mask&mask_on[n_kanal];				//¢®§¢à é ¥¬ 0, ¥á«¨ ª ­ « § ¬ª­ãâ ¨«¨ ¢ ­¨§ª®¬ ãà®¢­¥
}												//¨ ­¥ 0, ¥á«¨ à §®¬ª­ãâ ¨«¨ ¢ ¢ëá®ª®¬ ãà®¢­¥

//=======================‚á¯®¬ £ â¥«ì­ë¥ äã­ªæ¨¨ ¨ ¯à®æ¥¤ãàë ¤«ï à ¡®âë á COM-¯®àâ®¬======================

//--------------------------------Ž¯à¥¤¥«¨âì ª®«¨ç¥á¢® §­ ª®¢ ¢ ç¨á«¥-------------------------------------
int smb_counter(unsigned int chislo)				//¢¢®¤¨¬ ç¨á«®
{
	int kolvo=1;									//áç¥âç¨ª ª®«¨ç¥áâ¢  §­ ª®¢
	while (chislo=chislo/10)   						//ã¬¥­ìè ¥¬ à §àï¤­®áâì ç¨á«  ­  1 ¤® â¥å ¯®à,
	kolvo++;										//¯®ª  ®­® ­¥ áâ ­¥â à ¢­® 0
	return kolvo;									//¢®§¢à é ¥¬ ª®«¨ç¥áâ¢® §­ ª®¢
}
//--------------------------------‡ ¯¨á âì ¢ ¡ãä¥à á¨¬¢®«®¢ ¤«ï ®â¯à ¢ª¨ ¯® COM-¯®àâã ç¨á«®¢®¥ §­ ç¥­¨¥---
int smb_writer(int str_length, unsigned int chislo)	// ¢¢®¤¨¬ â¥ªãé¥¥ ª®«-¢® á¨¬¢®«®¢ ¢ ¡ãä¥à¥
{													// ¨ ç¨á«® ¤«ï § ¯¨á¨
	int i, smb_count;									
    smb_count=smb_counter(chislo); 					// Ž¯à¥¤¥«ï¥¬ ª®«-¢® á¨¬¢®«®¢ ¢ ç¨á«¥
	itoa(chislo,str,10);        					// ¯¥à¥¢®¤¨¬ ç¨á«® ¢ á¨¬¢®«ë ¢ áâà®ªã str
	for (i=0;i<smb_count;i++)							
	text_to_send[str_length+i]=str[i];				// ¯®á¨¬¢®«ì­® § ¯¨áë¢ ¥¬ ç¨á«® ¢ ¡ãä¥à á¨¬¢®«®¢
	return (str_length+smb_count);					// ¢®§¢à é ¥¬ â¥ªãéãî ¤«¨­ã ¡ãä¥à  á¨¬¢®«®¢
}
//--------------------------------‡ ¯¨á âì ¢ ¡ãä¥à á¨¬¢®«®¢ ¤«ï ®â¯à ¢ª¨ ¯® COM-¯®àâã è ¡«®­ á¨¬¢®«®¢-----
void pattern_writer(int str_length, int smb_count,char pattern[])
{
	int i;											
	for (i=0;i<smb_count;i++)						
		text_to_send[str_length+i]=pattern[i];		// ¯®á¨¬¢®«ì­® ¯¥à¥¯¨áë¢ ¥¬ è ¡«®­ ¢ ¡ãä¥à á¨¬¢®«®¢
}

//-------------------------------- à®æ¥¤ãà  ®¡à ¡®âª¨ ª®¬ ­¤ë #1000  ¢ à¨©­ ï ®áâ ­®¢ª  ®âª çª¨ ---------
void Avarya(void)
{
	vsp_long=0;
	R_Quants=R_Quants & mask_off[5];					//§ ¯¨áë¢ ¥¬ 0 ¢ 5 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (­ ¯ãáª ç¥à¥§ ƒ1)	
	Set5024(&vsp_long,slot_au,B_au_MFC1);				//ãáâ ­ ¢«¨¢ ¥¬ ¯®â®ª ƒ1 = 0
	R_Quants=R_Quants & mask_off[6];					//§ ¯¨áë¢ ¥¬ 0 ¢ 6 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (­ ¯ãáª ç¥à¥§ ƒ2)
	Set5024(&vsp_long,slot_au,B_au_MFC2);				//ãáâ ­ ¢«¨¢ ¥¬ ¯®â®ª ƒ2 = 0
	
	du_off(slot_du,B_du_TMN_on);						//¢ëª«îç ¥¬ ’Œ
	du_on(slot_du,B_du_FVN_on);							//¢ª«îç ¥¬ ”‚
		
	q_vacuum_stop.stt=START;							// ªâ¨¢¨àã¥¬ ¯à®æ¥áá ®áâ ­®¢ª¨ ®âª çª¨
	q_vacuum_start.stt=STOP;							//¤¥ªâ¨¢¨àã¥¬ ¯à®æ¥áá ®âª çª¨
	q_produv_start.stt=STOP;							//¤¥ ªâ¨¢¨àã¥¬ ¯à®æ¥áá ¯à®¤ã¢ 
	R_Quants=R_Quants & mask_off[2];					//§ ¯¨áë¢ ¥¬ 0 ¢ 2 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (‚‚ ®âª çª )
	R_Quants=R_Quants | mask_on[4];						//§ ¯¨áë¢ ¥¬ 1 ¢ 4 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (â®à¬®¦¥­¨¥ ’Œ)
	R_Quants=R_Quants & mask_off[3];					//§ ¯¨áë¢ ¥¬ 0 ¢ 3 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (à §£®­ ’Œ)
	R_Quants=R_Quants & mask_off[7];					//§ ¯¨áë¢ ¥¬ 0 ¢ 7 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (¯à®¤ã¢)
	auto_vacuum_start=1;								//¯à¨­ã¤¨â¥«ì­®  ¢â®¬ â¨§¨àã¥¬ ¯à®æ¥áá ®âª çª¨

	Get5050(slot_du,0,AWord,&v_mask);					//‘ç¨âë¢ ¥¬ á®áâ®ï­¨¥ ¬®¤ã«ï „“
	v_mask=(v_mask)&(0xF81F);							//¯¥à¥¢®¤¨¬ ª ­ «ë 5-10 ¢ ­¨§ª¨© ãà®¢¥­ì: 1111 1000 0001 1111
	Set5050(&v_mask,slot_du,0,AWord);					//§ ªàë¢ ¥¬ ª« ¯ ­ë £ §®¢®© «¨­¨¨
}

//=============================== à®æ¥¤ãà  ®¡­®¢«¥­¨ï á¥à¢¥à  ===========================================

void server_update(void)
{
	int i, strlen;
	double accel_distance;

//------------------------------- ‘ç¨âë¢ ¥¬ ¯®ª § ­¨ï ¬®¤ã«¥© ‹Š ----------------------------------------	
	for (i=0;i<8;i++)									
		{												
		Get5017H_P1(slot_ac,i,&ac_contr);				//‘ç¨âë¢ ¥¬ ¯®ª § ­¨ï ¬®¤ã«ï €Š
		vsp_array[i]=ac_contr&0x0FFF;					//¢® ¢á¯®¬®£ â¥«ì­ãî ¯¥à¥¬¥­­ãî
		}

	Get5050(slot_dc,0,AWord,&v_mask);					//‘ç¨âë¢ ¥¬ ¯®ª § ­¨ï ¬®¤ã«ï „Š
	rg_dc=v_mask;										//¢ à¥£¨áâà „Š
	
	Get5050(slot_du,0,AWord,&v_mask);					//‘ç¨âë¢ ¥¬ á®áâ®ï­¨¥ ¬®¤ã«ï „“
	rg_du=v_mask;										//¢ à¥£¨áâà „“

//------------------------------- Ž¡­®¢«ï¥¬/áç¨âë¢ ¥¬ ¯ ¬ïâì ®¡¬¥­  --------------------------------------	
	disable();											//‡ ¯à¥é ¥¬ ¯à¥àë¢ ­¨ï, çâ®¡ë ­¥ ¬¥­ï« áì ¯ ¬ïâì ®¡¬¥­ 
	Share_Mem[0]=R_Quants;								//®¡­®¢«ï¥¬ à¥£¨áâà á®áâ®ï­¨ï ¯à®æ¥áá®¢
	Share_Mem[1]=vsp_array[0]; 							//®¡­®¢«ï¥¬ ¯®ª § ­¨ï €Š
	Share_Mem[2]=vsp_array[1];
	Share_Mem[3]=vsp_array[2];
	Share_Mem[4]=vsp_array[3];
	Share_Mem[5]=vsp_array[4];
	Share_Mem[6]=vsp_array[5];
	Share_Mem[7]=vsp_array[6];
	Share_Mem[8]=vsp_array[7];
	ac_APG=Share_Mem[2];								//¯®ª § ­¨ï ¤ âç¨ª®¢ ¤ ¢«¥­¨ï § ­®á¨¬ ¢ ¯¥à¥¬¥­­ë¥
	ac_WRG=Share_Mem[3];								//¤«ï ¤ «ì­¥©è¥© à ¡®âë á ­¨¬¨
	Share_Mem[13]=com_rx();								//§ ¯¨áë¢ ¥¬ ®ç¥à¥¤­®© ¯à¨­ïâë© á¨¬¢®« ç¥à¥§ COM-¯®àâ
	Share_Mem[15]=rg_dc;								//®¡­®¢«ï¥¬ ¯®ª § ­¨ï „Š
	Share_Mem[17]=err_code;								//®¡­®¢«ï¥¬ §­ ç¥­¨¥ à¥£¨áâà  ®è¨¡®ª
	Share_Mem[20]=0;									//®¡­ã«ï¥¬ à¥£¨áâà á®áâ®ï­¨ï æ¨ª«  § ¯¨á¨/çâ¥­¨ï
	command=Share_Mem[21];								//áç¨âë¢ ¥¬ à¥£¨áâà, á®¤¥à¦ é¨© ª®¤ ª®¬ ­¤ë ª«¨¥­â 
	dop_command=Share_Mem[22];							//áç¨âë¢ ¥¬ à¥£¨áâà, á®¤¥à¦ é¨© ¯ à ¬¥âà ª®¬ ­¤ë
	Share_Mem[21]=0;									//®¡­ã«ï¥¬ à¥£¨áâà (ª®¬ ­¤  áç¨â ­ )
	Share_Mem[22]=0;									//®¡­ã«ï¥¬ à¥£¨áâà (¯ à ¬¥âà ª®¬ ­¤ë áç¨â ­)
	au_MFC1=Share_Mem[23];								//áç¨âë¢ ¥¬ ª ª®© ¯®â®ª ¨á¯®«ì§®¢ âì ¤«ï § ¤ ­¨ï ƒ1
	au_MFC2=Share_Mem[24];								//áç¨âë¢ ¥¬ ª ª®© ¯®â®ª ¨á¯®«ì§®¢ âì ¤«ï § ¤ ­¨ï ƒ2
	au_Shd_speed=Share_Mem[25];           				//áç¨âë¢ ¥¬ ª ªãî áª®à®áâì ¢à é¥­¨ï ¨á¯®«ì§®¢ âì ¤«ï ˜„
	au_Shd_accel=Share_Mem[26];           				//áç¨âë¢ ¥¬ ª ª®¥ ãáª®à¥­¨¥ ¢à é¥­¨ï ¨á¯®«ì§®¢ âì ¤«ï ˜„
	Share_Mem[27]=rg_du;     							//®¡­®¢«ï¥¬ á®áâ®ï­¨¥ „“
	Share_Mem[28]=au_Servo1;         					//®¡­®¢«ï¥¬ ¢ ª ª®¬ ¯®«®¦¥­¨¨ ­ å®¤¨âáï á¥à¢®¯à¨¢®¤ § á«®­ª¨
	Share_Mem[29]=au_Servo2;          					//®¡­®¢«ï¥¬ ¢ ª ª®¬ ¯®«®¦¥­¨¨ ­ å®¤¨âáï á¥à¢®¯à¨¢®¤ ¤à®áá¥«¨à®¢ ­¨ï
	enable();											// §à¥è ¥¬ ¯à¥àë¢ ­¨ï
	
//------------------------------- ˆá¯®«­¥­¨¥ ª®¬ ­¤ ª«¨¥­â  ----------------------------------------------	
	if (command!=0)										//¥á«¨ ¡ë«  ¯®«ãç¥­  ª®¬ ­¤  ®â ª«¨¥­â 
	{
	switch (command)
	{
//------------------------------- Š®¬ ­¤  ü1 § ¯ãáâ¨âì ®âª çªã -------------------------------------------
	case 1:
	if (dop_command==1)									//ª«¨¥­â ¯à®á¨â § ¯ãáâ¨âì ”‚
		{
		q_vacuum_start.stt=START;						// ªâ¨¢¨àã¥¬ ¯à®æ¥áá ®âª çª¨
		R_Quants=R_Quants | mask_on[1]; 				//§ ¯¨áë¢ ¥¬ 1 ¢ 1 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (”‚ ®âª çª )
		n1vacuum=0;										//®¡­ã«ï¥¬ áç¥âç¨ª ¢à¥¬¥­¨ ”‚ ®âª çª¨
		du_on(slot_du,B_du_FVN_on);						//§ ¯ãáª ¥¬ ”‚
		if ((ac_APG<550)||(ac_APG>4000)) 				//¥á«¨ ¯®ª § ­¨ï ¤ âç¨ª  APG ­¥ ¢ íâ®¬ ¤¨ ¯ §®­¥, â®
			err_code=err_code | mask_on[1]; 			//§ ¯¨áë¢ ¥¬ 1 ¢ 1 ¡¨â à¥£¨áâà  ®è¨¡®ª "®è¨¡ª  ¢ ªãã¬¥âà  APG"
		else err_code=err_code & mask_off[1]; 			//¨­ ç¥ § ¯¨áë¢ ¥¬ 0 ¢ 1 ¡¨â à¥£¨áâà  ®è¨¡®ª
		}
		
	if (dop_command==2)									//ª«¨¥­â ¯à®á¨â § ¯ãáâ¨â ’Œ				
		{
		if ((n1vacuum>Min_TMN_Time)&&(ac_WRG<WRG_st_TMN))	//¥á«¨ ¬¨­¨¬ «ì­®¥ ¢à¥¬ï ”‚ ®âª çª¨, ¤ ¢«¥­¨¥ WRG
		if (q_produv_start.stt==STOP)						//„®áâ¨£«® ¤ ¢«¥­¨ï § ¯ãáª  ’Œ ¨ ¯à®æ¥áá ¯à®¤ã¢ 
															//£ §®¢®© «¨­¨¨ ­¥  ªâ¨¢¥­
//		if (ac_APG<APG_st_TMN)     							//¥á«¨ ¤ ¢«¥­¨¥ APG ¤®áâ¨£«® ¤ ¢«¥­¨ï áâ àâ  ’Œ
			{
			n_vacuum=2;    								//â¥ªãé¨© íâ ¯ ®âª çª¨ - 2
			du_on(slot_du,B_du_TMN_on);  				//§ ¯ãáª ¥¬ ’Œ
			q_vacuum_stop.stt=STOP;						//¤¥ ªâ¨¢¨àã¥¬ ¯à®æ¥áá ®áâ ­®¢  ®âª çª¨
			q_vacuum_start.stt=START;					// ªâ¨¢¨àã¥¬ ¯à®æ¥áá ®âª çª¨
			R_Quants=R_Quants | mask_on[2]; 			//§ ¯¨áë¢ ¥¬ 1 ¢ 2 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (‚‚ ®âª çª )
			R_Quants=R_Quants | mask_on[3]; 			//§ ¯¨áë¢ ¥¬ 1 ¢ 3 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (à §£®­ ’Œ)
			R_Quants=R_Quants & mask_off[4];			//§ ¯¨áë¢ ¥¬ 0 ¢ 4 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (â®à¬®¦¥­¨¥ ’Œ)
			err_code=err_code & mask_off[2]; 			//§ ¯¨áë¢ ¥¬ 0 ¢ 2 ¡¨â à¥£¨áâà  ®è¨¡®ª 
			}
		else
			err_code=err_code | mask_on[2]; 			//¨­ ç¥ § ¯¨áë¢ ¥¬ 1 ¢ 2 ¡¨â à¥£¨áâà  ®è¨¡®ª "¤ ¢«¥­¨¥ ¢ëè¥ âà¥¡ã¥¬®£®"
		}
	break;

//------------------------------- Š®¬ ­¤  ü2 ®áâ ­®¢¨âì ®âª çªã ------------------------------------------
	case 2:		
	if (dop_command==1)									//ª«¨¥­â ¯à®á¨â ¢ëª«îç¨âì ”‚
		{
		if ((R_Quants & mask_on[2])==0)					//¥á«¨ 2 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ = 0 (‚‚ ®âª çª )
		if ((R_Quants & mask_on[4])==0)					//¥á«¨ 4 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ = 0 (â®à¬®¦¥­¨¥ ’Œ)
			{
			du_off(slot_du,B_du_FVN_on);				//¢ëª«îç ¥¬ ”‚
			q_vacuum_stop.stt=STOP;						//¤¥ ªâ¨¢¨àã¥¬ ¯à®æ¥áá ®áâ ­®¢  ®âª çª¨
			R_Quants=R_Quants & mask_off[1];			//§ ¯¨áë¢ ¥¬ 0 ¢ 1 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (”‚ ®âª çª )
			du_off(slot_du,B_du_VE_2_on);				//§ ªàë¢ ¥¬ ª« ¯ ­ë 2,3,5,6
			du_off(slot_du,B_du_VE_3_on);
			du_off(slot_du,B_du_VE_5_on);
			du_off(slot_du,B_du_VE_6_on);

			if (q_produv_start.stt==START)	 			//¥á«¨ ¡ë« § ¯ãé¥­ ¯à®æ¥áá ¯à®¤ã¢  £ §®¢®© «¨­¨¨
				{
				q_produv_start.stt=STOP;				//¥ ªâ¨¢¨àã¥¬ ¯à®æ¥áá ¯à®¤ã¢  £ §®¢®© «¨­¨¨
				R_Quants=R_Quants & mask_off[7];		//§ ¯¨áë¢ ¥¬ 0 ¢ 1 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (¯à®¤ã¢)
				R_Quants=R_Quants & mask_off[5]; 		//§ ¯¨áë¢ ¥¬ 0 ¢ 5 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (­ ¯ãáª ç¥à¥§ ƒ1) 
				vsp_long=0;                				
				Set5024(&vsp_long,slot_au,B_au_MFC1);	//ãáâ ­ ¢«¨¢ ¥¬ ¯®â®ª ƒ1 = 0
				R_Quants=R_Quants & mask_off[6]; 		//§ ¯¨áë¢ ¥¬ 0 ¢ 6 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (­ ¯ãáª ç¥à¥§ ƒ2) 
				vsp_long=0;               
				Set5024(&vsp_long,slot_au,B_au_MFC2);	//ãáâ ­ ¢«¨¢ ¥¬ ¯®â®ª ƒ2 = 0
				}
			}
		}
		
	if (dop_command==2)									//ª«¨¥­â ¯à®á¨â ¢ëª«îç¨âì ’Œ
		{
		du_off(slot_du,B_du_TMN_on);					//¢ëª«îç ¥¬ ’Œ
		q_vacuum_stop.stt=START;						// ªâ¨¢¨àã¥¬ ¯à®æ¥áá ®áâ ­®¢  ®âª çª¨
		q_vacuum_start.stt=STOP;						//¤¥ ªâ¨¢¨àã¥¬ ¯à®æ¥áá ®âª çª¨
		R_Quants=R_Quants & mask_off[2];				//§ ¯¨áë¢ ¥¬ 0 ¢ 2 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (‚‚ ®âª çª )
		R_Quants=R_Quants & mask_off[3];				//§ ¯¨áë¢ ¥¬ 0 ¢ 3 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (à §®­ ’Œ)
		R_Quants=R_Quants | mask_on[4];					//§ ¯¨áë¢ ¥¬ 1 ¢ 4 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (â®à¬®¦¥­¨¥ ’Œ)
		du_off(slot_du,B_du_VE_2_on);					//§ ªàë¢ ¥¬ ª« ¯ ­ë 2,3,5,6
		du_off(slot_du,B_du_VE_3_on);
		du_off(slot_du,B_du_VE_5_on);
		du_off(slot_du,B_du_VE_6_on);
		}
	break;
	
//------------------------------- Š®¬ ­¤  ü3 ­ ¯ãáª âì £ § ç¥à¥§ ƒ1 ------------------------------------
	case 3:		
	if (au_MFC1>0)										//¥á«¨ § ¤ ­¨¥ ¯®â®ª  ¡®«è¥ ­ã«ï
		{
		R_Quants=R_Quants | mask_on[5]; 				//§ ¯¨áë¢ ¥¬ 1 ¢ 5 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (­ ¯ãáª ç¥à¥§ ƒ1)
		vsp_long=au_MFC1;               				
		Set5024(&vsp_long,slot_au,B_au_MFC1);			//§ ¤ ¥¬ ¯®â®ª  ƒ1 = au_MFC1
		}
	else												//¨­ ç¥
		{
		R_Quants=R_Quants & mask_off[5];				//§ ¯¨áë¢ ¥¬ 0 ¢ 5 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (­ ¯ãáª ç¥à¥§ ƒ1)
		vsp_long=au_MFC1;
		Set5024(&vsp_long,slot_au,B_au_MFC1);			//ãáâ ­ ¢«¨¢ ¥¬ ¯®â®ª ƒ1 = 0
		}
	break;
	
//------------------------------- Š®¬ ­¤  ü4 ­ ¯ãáª âì £ § ç¥à¥§ ƒ2 ------------------------------------
	case 4:
	if (au_MFC2>0)										//¥á«¨ § ¤ ­¨¥ ¯®â®ª  ¡®«è¥ ­ã«ï
		{
		R_Quants=R_Quants | mask_on[6]; 				//§ ¯¨áë¢ ¥¬ 1 ¢ 6 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (­ ¯ãáª ç¥à¥§ ƒ2)
		q_napusk_start.stt=START;						// ªâ¨¢¨àã¥¬ ¯à®æ¥áá ¯®áâ¥¯¥­­®£® ã¢¥«¨ç¥­¨ï ¯®â®ª  ¤® § ¤ ­­®£® §­ ç¥­¨ï
		}
	else												//¨­ ç¥
		{												
		R_Quants=R_Quants & mask_off[6];				//§ ¯¨áë¢ ¥¬ 0 ¢ 6 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (­ ¯ãáª ç¥à¥§ ƒ2)
		vsp_long=au_MFC2;
		Set5024(&vsp_long,slot_au,B_au_MFC2);			//ãáâ ­ ¢«¨¢ ¥¬ ¯®â®ª ƒ2 = 0
		au_prev_MFC2=0;									//®¡­®¢«ï¥¬ ¯¥à¥¬¥­­ãî "¯à¥¤ë¤ãé¥¥ §­ ç¥­¨¥ ¯®â®ª " = 0
		}
	break;
	
//------------------------------- Š®¬ ­¤  ü5 ®âªàëâì/§ ªàëâì ª« ¯ ­ --------------------------------------
	case 5:
	du_inv(slot_du,dop_command+4);						//¯¥à¥ª«îç¨âì á®áâ®ï­¨¥ ª« ¯ ­  (ü = dop_command)
	break;
	
//------------------------------- Š®¬ ­¤  ü6 ¨§¬¥­¨âì ¯®«®¦¥­¨¥ á¥à¢®¯à¨¢®¤  § á«®­ª¨ --------------------
	case 6:
	au_Servo1=dop_command;								//®¡­®¢«ï¥¬ ¯¥à¥¬¥­­ãî ¯®«®¦¥­¨ï á¥à¢®¯à¨¢®¤ 
	vsp_long=au_Servo1;
	Set5024(&vsp_long,slot_au,B_au_Servo1);				//§ ¤ ¥¬ ¯®«®¦¥­¨¥ á¥à¢®¯à¨¢®¤  = au_Servo1
	break;
	
//------------------------------- Š®¬ ­¤  ü7 ¨§¬¥­¨âì ¯®«®¦¥­¨¥ á¥à¢®¯à¨¢®¤  ¤à®áá¥«¨à®¢ ­¨ï -------------
    case 7:
	au_Servo2=dop_command;								//®¡­®¢«ï¥¬ ¯¥à¥¬¥­­ãî ¯®«®¦¥­¨ï á¥à¢®¯à¨¢®¤ 
	vsp_long=au_Servo2;
	Set5024(&vsp_long,slot_au,B_au_Servo2);				//§ ¤ ¥¬ ¯®«®¦¥­¨¥ á¥à¢®¯à¨¢®¤  = au_Servo2
	break;
	
//------------------------------- Š®¬ ­¤ë ü10,20,30,40 ¢ª«./¢ëª«.  ¢â®¬ â¨§ æ¨¨ --------------------------
	case 10:
	auto_vacuum_start=1;								// ¢â®¬ â¨ç¥áª¨ ¯¥à¥å®¤¨âì ­  ‚‚ ®âª çªã
	break;
	
	case 20:
	auto_vacuum_start=0;								//… ¯¥à¥å®¤¨âì  ¢â®¬ â¨ç¥áª¨ ­  ‚‚ ®âª çªã
	break;
	
	case 30:
	auto_produv_start=1;								// ¢â®¬ â¨ç¥áª¨ ¯à®¤ã¢ âì £ §®¢ãî «¨­¨î
	produv_time=dop_command;
	break;												//¢® ¢à¥¬ï ”‚ ®âª çª¨
	
	case 40:
	auto_produv_start=0;								//… ¯à®¤ã¢ âì  ¢â®¬ â¨ç¥áª¨ £ §®¢ãî «¨­¨î
	break;												//¢® ¢à¥¬ï ”‚ ®âª çª¨

//------------------------------- Š®¬ ­¤  ü51 ®â¯à ¢¨âì á¨¬¢®« ç¥à¥§ COM-¯®àâ 1 --------------------------	
	case 51:
	com_tx(dop_command);								//®â¯à ¢«ï¥¬ á¨¬¢®«, ª®¤ ASCII ª®â®à®£® = dop_command
	break;
	
//------------------------------- Š®¬ ­¤  ü52 ¢à é âì ˜„ á § ¤ ­­®© áª®à®áâìî ----------------------------	
	case 52:
	if ((R_Quants & mask_on[8])==0)						//¥á«¨ ­¥  ªâ¨¢¥­ ¯à®æ¥á ®â¯à ¢ª¨ á¨¬¢®«®¢ ç¥à¥§ COM-¯®àâ
		{
		R_Quants=R_Quants | mask_on[8];					//§ ¯¨áë¢ ¥¬ 1 ¢ 8 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (®â¯à ¢ª  á¨¬¢®«®¢)
		q_com_tx.stt=START;								// ªâ¨¢¨àã¥¬ ¯à®æ¥áá ®â¯à ¢ª¨ á¨¬¢®«®¢ ç¥à¥§ COM-¯®àâ
		if (dop_command==1)								//¥á«¨ ª«¨¥­â § ¯à è¨¢ ¥â ¯®¢®à®â ¯® ç á®¢®© áâà¥«ª¥
			pattern_writer(0,13,start_right);			//§ ¯¨áë¢ ¥¬ ¢ ¡ãä¥à 13 á¨¬¢®«®¢ <LM>DR>SS0>AL á ­ã«¥¢®£®
		if (dop_command==2)								//¥á«¨ ª«¨¥­â § ¯à è¨¢ ¥â ¯®¢®à®â ¯à®â¨¢ ç á®¢®© áâà¥«ª¨
			pattern_writer(0,13,start_left);			//§ ¯¨áë¢ ¥¬ ¢ ¡ãä¥à 13 á¨¬¢®«®¢ <LM>DL>SS0>AL á ­ã«¥¢®£®
		strlen=smb_writer(13,au_Shd_accel);				//¤®¡ ¢«ï¥¬ ¢ ¡ãä¥à §­ ç¥­¨¥ ãáª®à¥­¨ï, ¢®§¢à é ¥¬ â¥ªãéãî ¤«¨­ã ¡ãä¥à 
		pattern_writer(strlen,3,speed_text);			//¤®¡ ¢«ï¥¬ >SD
		strlen=smb_writer(3+strlen,au_Shd_speed);		//¤®¡ ¢«ï¥¬ §­ ç¥­¨¥ áª®à®áâ¨
		pattern_writer(strlen,7,move_text);				//¤®¡ ¢«ï¥¬ >MV>FS>
		smb_to_send=7+strlen;							//§ ¯¨áë¢ ¥¬ ¢ ¯¥à¥¬¥­­ãî ¨â®£®¢ãî ¤«¨­ã ¡ãä¥à 
		SHd_state=FALSE;								//§ ¯¨áë¢ ¥¬, çâ® ¯®«®¦¥­¨¥ ˜„ ­¥ ®¯à¥¤¥«¥­®
		}		
	break;

//------------------------------- Š®¬ ­¤  ü53 ®áâ ­®¢¨âì ˜„ ----------------------------------------------
	case 53:
	if ((R_Quants & mask_on[8])==0)						//¥á«¨ ­¥  ªâ¨¢¥­ ¯à®æ¥á ®â¯à ¢ª¨ á¨¬¢®«®¢ ç¥à¥§ COM-¯®àâ
		{
		du_on(slot_du,B_du_SMC_reset);					//¯®¤ ¥¬ á¨£­ « ­  ¢å®¤ reset ª®­âà®««¥à  ˜„
		q_SMC_reset.stt=START;							// ªâ¨¢¨àã¥¬ ¯à®æ¥áá ¯¥à¥ª«îç¥­¨ï á¨£­ «  á¡à®á ª®­âà®««¥à  ˜„
		Timer_Reset(q_SMC_reset.tm);					//¯¥à¥§ ¯ãáª ¥¬ â ©¬¥à ¯à®æ¥áá 
		SHd_state=FALSE;								//§ ¯¨áë¢ ¥¬, çâ® ¯®«®¦¥­¨¥ ˜„ ­¥ ®¯à¥¤¥«¥­®
		}
	break;
	
//------------------------------- Š®¬ ­¤  ü54 ¯¥à¥¬¥áâ¨âì ˜„ ¤® § ¤ ­­®© ª®®à¤¨­ âë ----------------------	
	case 54:
	if ((R_Quants & mask_on[8])==0)						//¥á«¨ ­¥  ªâ¨¢¥­ ¯à®æ¥á ®â¯à ¢ª¨ á¨¬¢®«®¢ ç¥à¥§ COM-¯®àâ
		{
		R_Quants=R_Quants | mask_on[8];					//§ ¯¨áë¢ ¥¬ 1 ¢ 8 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (®â¯à ¢ª  á¨¬¢®«®¢)
		q_com_tx.stt=START;								// ªâ¨¢¨àã¥¬ ¯à®æ¥áá ®â¯à ¢ª¨ á¨¬¢®«®¢ ç¥à¥§ COM-¯®àâ
		if (SHd_state==false)							//¥á«¨ ­¥ ¨§¢¥áâ­® â¥ªãé¥¥ ¯®«®¦¥­¨¥ ˜„
			{
			pattern_writer(0,33,home_first);			//§ ¯¨áë¢ ¥¬ ¢ ¡ãä¥à 33 á¨¬¢®«®¢ <LM>DR>SD100>HM>DL>MV120>DR>HM>MV á ­ã«¥¢®£®ë
			strlen = smb_writer( 33, dop_command + NULL_MAG_DELTA ); //¤®¡ ¢«ï¥¬ ç¨á«® è £®¢ (ç¨á«® è £®¢ = ª®®à¤¨­ â¥)
			pattern_writer(strlen,4,start_text);		//¤®¡ ¢«ï¥¬ >FS>
			smb_to_send=4+strlen;						//§ ¯¨áë¢ ¥¬ ¢ ¯¥à¥¬¥­­ãî ¨â®£®¢ãî ¤«¨­ã ¡ãä¥à 
			SHd_position=dop_command;					//§ ¯¨áë¢ ¥¬ â¥ªãéãî ª®®à¤¨­ âã ˜„
			SHd_state=TRUE;								//§ ¯¨áë¢ ¥¬, çâ® ¯®«®¦¥­¨¥ ˜„ ®¯à¥¤¥«¥­®
			}
		else											//¥á«¨ ¨§¢¥áâ­® â¥ªãé¥¥ ¯®«®¦¥­¨¥ ˜„
			{
			pattern_writer(0,15,step_right);			//§ ¯¨áë¢ ¥¬ ¢ ¡ãä¥à 15 á¨¬¢®«®¢ <LM>DR>SD100>MV á ­ã«¥¢®£®
			dop_command=(dop_command+800-SHd_position)%800;	//à ááç¨âë¢ ¥¬ áª®«ìª® è £®¢ ­ã¦­® á¤¥« âì ¤® § ¤ ­­®© ª®®à¤¨­ âë
			strlen=smb_writer(15,dop_command);          //¤®¡ ¢«ï¥¬ ç¨á«® è £®¢
			pattern_writer(strlen,4,start_text);		//¤®¡ ¢«ï¥¬ >FS>
			smb_to_send=4+strlen;						//§ ¯¨áë¢ ¥¬ ¢ ¯¥à¥¬¥­­ãî ¨â®£®¢ãî ¤«¨­ã ¡ãä¥à 
			SHd_position=(SHd_position+dop_command)%800;	//§ ¯¨áë¢ ¥¬ â¥ªãéãî ª®®à¤¨­ âã ˜„
			}
		}
	break;
	
//------------------------------- Š®¬ ­¤  ü55 ¯¥à¥¬¥áâ¨âì ˜„ ¯® ç á®¢®© áâà¥«ª¥ --------------------------
	case 55:
	if ((R_Quants & mask_on[8])==0)						//¥á«¨ ­¥  ªâ¨¢¥­ ¯à®æ¥á ®â¯à ¢ª¨ á¨¬¢®«®¢ ç¥à¥§ COM-¯®àâ
		{
		R_Quants=R_Quants | mask_on[8];					//§ ¯¨áë¢ ¥¬ 1 ¢ 8 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (®â¯à ¢ª  á¨¬¢®«®¢)
		q_com_tx.stt=START;								// ªâ¨¢¨àã¥¬ ¯à®æ¥áá ®â¯à ¢ª¨ á¨¬¢®«®¢ ç¥à¥§ COM-¯®àâ
		pattern_writer(0,15,step_right);				//§ ¯¨áë¢ ¥¬ ¢ ¡ãä¥à 15 á¨¬¢®«®¢ <LM>DR>SD100>MV á ­ã«¥¢®£®
		strlen=smb_writer(15,dop_command);          	//¤®¡ ¢«ï¥¬ ç¨á«® è £®¢
		pattern_writer(strlen,4,start_text);			//¤®¡ ¢«ï¥¬ >FS>
		smb_to_send=4+strlen;							//§ ¯¨áë¢ ¥¬ ¢ ¯¥à¥¬¥­­ãî ¨â®£®¢ãî ¤«¨­ã ¡ãä¥à 
		SHd_position=(SHd_position+dop_command)%800;	//§ ¯¨áë¢ ¥¬ â¥ªãéãî ª®®à¤¨­ âã ˜„
		}
	break;
	
//------------------------------- Š®¬ ­¤  ü56 ¯¥à¥¬¥áâ¨âì ˜„ ¯à®â¨¢ ç á®¢®© áâà¥«ª¨ ----------------------	
	case 56:
	if ((R_Quants & mask_on[8])==0)						//¥á«¨ ­¥  ªâ¨¢¥­ ¯à®æ¥á ®â¯à ¢ª¨ á¨¬¢®«®¢ ç¥à¥§ COM-¯®àâ
		{
		R_Quants=R_Quants | mask_on[8];					//§ ¯¨áë¢ ¥¬ 1 ¢ 8 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (®â¯à ¢ª  á¨¬¢®«®¢)
		q_com_tx.stt=START;								// ªâ¨¢¨àã¥¬ ¯à®æ¥áá ®â¯à ¢ª¨ á¨¬¢®«®¢ ç¥à¥§ COM-¯®àâ
		pattern_writer(0,15,step_left);					//§ ¯¨áë¢ ¥¬ ¢ ¡ãä¥à 15 á¨¬¢®«®¢ <LM>DL>SD100>MV á ­ã«¥¢®£®
		strlen=smb_writer(15,dop_command);          	//¤®¡ ¢«ï¥¬ ç¨á«® è £®¢
		pattern_writer(strlen,4,start_text);			//¤®¡ ¢«ï¥¬ >FS>
		smb_to_send=4+strlen;							//§ ¯¨áë¢ ¥¬ ¢ ¯¥à¥¬¥­­ãî ¨â®£®¢ãî ¤«¨­ã ¡ãä¥à 
		SHd_position=(SHd_position+800-dop_command)%800;	//§ ¯¨áë¢ ¥¬ â¥ªãéãî ª®®à¤¨­ âã ˜„
		}
	break;
	
//------------------------------- Š®¬ ­¤  ü57 § ¤ âì áª ­¨àãîé¥¥ ¤¢¨¦¥­¨¥ ˜„ -----------------------------
	case 57:
	if ((R_Quants & mask_on[8])==0)						//¥á«¨ ­¥  ªâ¨¢¥­ ¯à®æ¥á ®â¯à ¢ª¨ á¨¬¢®«®¢ ç¥à¥§ COM-¯®àâ
		{
		R_Quants=R_Quants | mask_on[8];					//§ ¯¨áë¢ ¥¬ 1 ¢ 8 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (®â¯à ¢ª  á¨¬¢®«®¢)
		q_com_tx.stt=START;								// ªâ¨¢¨àã¥¬ ¯à®æ¥áá ®â¯à ¢ª¨ á¨¬¢®«®¢ ç¥à¥§ COM-¯®àâ
		pattern_writer(0,15,step_left);					//§ ¯¨áë¢ ¥¬ ¢ ¡ãä¥à 15 á¨¬¢®«®¢ <LM>DL>SD100>MV á ­ã«¥¢®£®
		strlen=smb_writer(15,dop_command/2);			//¤®¡ ¢«ï¥¬ ç¨á«® è £®¢ à ¢­®¥ ¯®«®¢¨­¥ ¤«¨­ë ¤ã£¨
		pattern_writer(strlen,13,scan_init);			//¤®¡ ¢«ï¥¬ >RS>LL>SS0>AL
	    strlen=smb_writer(13+strlen,au_Shd_accel);		//¤®¡ ¢«ï¥¬ §­ ç¥­¨¥ ãáª®à¥­¨ï ¯à¨ à §£®­¥
		pattern_writer(strlen,3,speed_text);				//¤®¡ ¢«ï¥¬ >SD
	    strlen=smb_writer(3+strlen,au_Shd_speed);		//¤®¡ ¢«ï¥¬ §­ ç¥­¨¥ áª®à®áâ¨ áª ­¨à®¢ ­¨ï
		pattern_writer(strlen,3,mv_text);				//¤®¡ ¢«ï¥¬ >MV
	    accel_distance=pow(au_Shd_speed,2)/(2*au_Shd_accel);	//à ááç¨âë¢ ¥¬ ¤«¨­ã ¤ã£¨ ãáª®à¥­¨ï
	    strlen=smb_writer(3+strlen,((dop_command/2)*2)-ceil(accel_distance));
																//¤®¡ ¢«ï¥¬ ¯¥à¥¬¥é¥­¨¥ ¤® ­ ç «  â®à¬®¦¥­¨ï
		pattern_writer(strlen,4,acc_text);				//¤®¡ ¢«ï¥¬ >AL-
	    strlen=smb_writer(4+strlen,au_Shd_accel);		//¤®¡ ¢«ï¥¬ §­ ç¥­¨¥ ãáª®à¥­¨ï ¯à¨ â®à¬®¦¥­¨¨
		pattern_writer(strlen,7,scan_speed);			//¤®¡ ¢«ï¥¬ >SD0>MV
		strlen=smb_writer(7+strlen,ceil(accel_distance));	//¤®¡ ¢«ï¥¬ ¤«¨­ã ¤ã£¨ â®à¬®¦¥­¨ï
		pattern_writer(strlen,15,scan_start);			//¤®¡ ¢«ï¥¬ >RS>JP5>JP2>FS>
	    smb_to_send=15+strlen;							//§ ¯¨áë¢ ¥¬ ¢ ¯¥à¥¬¥­­ãî ¨â®£®¢ãî ¤«¨­ã ¡ãä¥à 
		SHd_state=FALSE;								//§ ¯¨áë¢ ¥¬, çâ® ¯®«®¦¥­¨¥ ˜„ ­¥ ®¯à¥¤¥«¥­®
		}
	break;
	
 //------------------------------- Š®¬ ­¤  ü100 § ¢¥àè¥­¨¥ à ¡®âë ¯à®£à ¬¬ë ------------------------------  	
	case 100:
	dispetcher=PASSIV;									//®áâ ­ ¢«¨¢ ¥¬ æ¨ª«¨ç­®áâì ¤¨á¯¥âç¥à  § ¤ ç
	break;
	
 //------------------------------- Š®¬ ­¤  ü1000  ¢ à¨©­ ï ®áâ ­®¢ª  ®âª çª¨ -----------------------------	
	case 1000:
	Avarya();											//¢ë¯®«­ï¥¬ ¯à®æ¥¤ãàã Avarya
	break;
	}													//Š®­¥æ ¤¥è¨äà®¢ª¨ ª®¬ ­¤
	}
}

//================================ à®æ¥¤ãàë ®¡á«ã¦¨¢ ­¨ï ¯à®æ¥áá®¢ ======================================

//-------------------------------- à®æ¥¤ãà  ¯à®æ¥áá  ®âª çª¨ --------------------------------------------
void vacuum_start(void)
{
	switch (n_vacuum)										//¯à®æ¥áá à §¤¥«¥­ ­  3 íâ ¯ :
	{
	case 1:													//íâ ¯ 1: ”‚ ®âª çª 
		n1vacuum=n1vacuum+1;								//áç¨â ¥¬ ¢à¥¬ï à ¡®âë ”‚ ­ á®á 
															//¯à®¢¥àª  § ¯ãáª  ¯à®¤ã¢  
		if ((n1vacuum>120)&&(auto_produv_start==1))			//¥á«¨ ¯à®è«® 120á ¨ § ¯ãáª ¯à®¤ã¢   ¢â®¬ â¨§¨à®¢ ­
		if ((q_produv_start.stt==STOP)&&(produv_state==0))	//¯à¨ íâ®¬ ¯à®¤ã¢ ¥é¥ ­¥ § ¯ãé¥­ ¨ ­¥ ¡ë« § ¢¥àè¥­
			{
			n1produv=0;										//®¡­ã«ï¥¬ ¢à¥¬ï ¯à®¤ã¢ 
			q_produv_start.stt=START;						// ªâ¨¢¨àã¥¬ ¯à®æ¥áá ¯à®¤ã¢  £ §®¢®© «¨­¨¨
			R_Quants=R_Quants | mask_on[7];					//§ ¯¨áë¢ ¥¬ 1 ¢ 7 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (¯à®¤ã¢)
			du_on(slot_du,B_du_VE_2_on);					//®âªàë¢ ¥¬ ª« ¯ ­ë 2,3,5,6 £ §®¢®© «¨­¨¨
			du_on(slot_du,B_du_VE_3_on);
			du_on(slot_du,B_du_VE_5_on);
			du_on(slot_du,B_du_VE_6_on);
			R_Quants=R_Quants | mask_on[5];					//§ ¯¨áë¢ ¥¬ 1 ¢ 5 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (­ ¯ãáª ç¥à¥§ ƒ1)
			vsp_long=5000;
			Set5024(&vsp_long,slot_au,B_au_MFC1);			//§ ¤ ¥¬ ¯®â®ª  ƒ1 = 5000 ¤¨áªà¥â
			R_Quants=R_Quants | mask_on[6];					//§ ¯¨áë¢ ¥¬ 1 ¢ 6 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (­ ¯ãáª ç¥à¥§ ƒ2)
			vsp_long=5000;
			Set5024(&vsp_long,slot_au,B_au_MFC2);			//§ ¤ ¥¬ ¯®â®ª  ƒ2 = 5000 ¤¨áªà¥â
			}
															//¯à¨­ã¤¨â¥«ì­®¥ ®âªàëâ¨¥ ª« ¯ ­®¢ ¤«ï ®âª çª¨ £ §®¢®© «¨­¨¨
		if ((n1vacuum==120)&&(auto_vacuum_start==1)&&(auto_produv_start==0))
			{												//¥á«¨ ¯à®è«® 120á ¨ ®âª çª   ¢â®¬ â¨§¨à®¢ ­ 
			du_on(slot_du,B_du_VE_2_on);					//â® ®âªàë¢ ¥¬ ª« ¯ ­ë 2,3,5,6
			du_on(slot_du,B_du_VE_3_on);
			du_on(slot_du,B_du_VE_5_on);
			du_on(slot_du,B_du_VE_6_on);
			}
															//¯à®¢¥àª  § ¯ãáª  ’Œ
		if ((n1vacuum>Min_TMN_Time)&&(auto_vacuum_start==1))	//¥á«¨ ¯à®è«® ¬¨­¨¬ «ì­®¥ ¢à¥¬ï ¤«ï § ¯ãáª  ’Œ
		if ((q_produv_start.stt==STOP)&&(ac_WRG<WRG_st_TMN))	// ¨ ®âª çª   ¢â®¬ â¨§¨à®¢ ­ , ¯à¨ íâ®¬ ¯à®æ¥áá ¯à®¤ã¢  ­¥  ªâ¨¢¥­
			{													// ¨ ¤ ¢«¥­¨¥ ¤®áâ®â®ç­® ­¨§ª®¥ ¤«ï § ¯ãáª  ’Œ
			n_vacuum=2;    									//¨­¨æ¨¨àã¥¬ ¯¥à¥å®¤ ­  2 íâ ¯
			du_on(slot_du,B_du_TMN_on);						//§ ¯ãáª ¥¬ ’Œ
			R_Quants=R_Quants | mask_on[2];					//§ ¯¨áë¢ ¥¬ 1 ¢ 2 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (‚‚ ®âª çª )
			R_Quants=R_Quants | mask_on[3];					//§ ¯¨áë¢ ¥¬ 1 ¢ 3 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (à §£®­ ’Œ)
			R_Quants=R_Quants & mask_off[4];				//§ ¯¨áë¢ ¥¬ 0 ¢ 4 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (â®à¬®¦¥­¨¥ ’Œ)
			}
	break;

	case 2:													//íâ ¯ 2: à §£®­ ’Œ
		if ((a_cntrl(slot_ac,B_ac_TIC)>3600)&&(a_cntrl(slot_ac,B_ac_TIC)<3700))
			{												//¥á«¨ áª®à®áâì ¢à é¥­¨ï âãà¡¨­ 100%
			R_Quants=R_Quants & mask_off[3];				//§ ¯¨áë¢ ¥¬ 0 ¢ 3 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (à §£®­ ’Œ)
			n_vacuum=3;										//¨­¨æ¨¨àã¥¬ ¯¥à¥å®¤ ­  3 íâ ¯
			}
	break;
	
	case 3:													//íâ ¯ 3: á«¥¦¥­¨¥ §  ¢ ªãã¬®¬
		if (ac_WRG>P_WRG_B)									//¥á«¨ ¤ ¢«¥­¨¥ ®¯ãáâ¨«®áì ­¨¦¥ ä¨ªá¨à®¢ ­­®© ®â¬¥âª¨
			err_code=err_code | mask_on[3];					//§ ¯¨áë¢ ¥¬ 1 ¢ 3 ¡¨â à¥£¨áâà  ®è¨¡®ª "«®å®© ¢ ªãã¬"
		else err_code=err_code & mask_off[3];				//¨­ ç¥ § ¯¨áë¢ ¥¬ 0 ¢ 3 ¡¨â à¥£áâà  ®è¨¡®ª
	break;
	}
}

//-------------------------------- à®æ¥¤ãà  ¯à®æ¥áá  ®áâ ­®¢ª¨ ®âª çª¨ ----------------------------------
void vacuum_stop(void)
{
	switch (n_vacuum)										//¢ § ¢¨á¨¬®áâ¨ ®â â®£®, ­  ª ª®¬ íâ ¯¥ ®âª çª¨ ­ å®¤¨¬áï
	{
	case 3:													//¥á«¨ ­  3 íâ ¯¥
		n_vacuum=2;											//¯¥à¥å®¤¨¬ ­  2 íâ ¯
	break;
	
	case 2:													//¥á«¨ ­  2 íâ ¯¥: â®à¬®¦¥­¨¥ ’Œ
		if ((a_cntrl(slot_ac,B_ac_TIC)<10)||(a_cntrl(slot_ac,B_ac_TIC)>4000))
			{												//¥á«¨ áª®à®áâì ¢à é¥­¨ï âãà¡¨­ = 0%
			n_vacuum=1;										//¨­¨æ¨¨àã¥¬ ¯¥à¥å®¤ ­  1 íâ ¯
			R_Quants=R_Quants & mask_off[4];				//§ ¯¨áë¢ ¥¬ 0 ¢ 4 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (â®à¬®¦¥­¨¥ ’Œ)		
			}
	break;
	
	case 1:													//¥á«¨ ­  1 íâ ¯¥: ”‚ ®âª çª 
		if (auto_vacuum_start==1)							//¥á«¨ ¯à®æ¥áá ®âª çª¨  ¢â®¬ â¨§¨à®¢ ­
			{
			du_off(slot_du,B_du_FVN_on);					//¢ëª«îç ¥¬ ”‚
			q_vacuum_stop.stt=STOP;							//¤¥ ªâ¨¢¨àã¥¬ ¯à®æ¥áá ®áâ ­®¢ª¨ ®âª çª¨
			R_Quants=R_Quants & mask_off[1];				//§ ¯¨áë¢ ¥¬ 0 ¢ 1 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (”‚ ®âª çª )
			}
	break;
	}
}
//-------------------------------- à®æ¥¤ãà  ¯à®æ¥áá  ¯à®¤ã¢  £ §®¢®© «¨­¨¨ ------------------------------
void produv_start(void)
{
	n1produv=n1produv+1;									//áç¨â ¥¬ ¢à¥¬ï ¯à®¤ã¢  
	if (n1produv>produv_time)										//¥á«¨ ¯à®è«® 5 ¬¨­
		{
		q_produv_start.stt=STOP;							//¤¥ ªâ¨¢¨àã¥¬ ¯à®æ¥áá ¯à®¤ã¢ 							
		R_Quants=R_Quants & mask_off[7];					//§ ¯¨áë¢ ¥¬ 0 ¢ 7 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (¯à®¤ã¢)
		R_Quants=R_Quants & mask_off[5];					//§ ¯¨áë¢ ¥¬ 0 ¢ 5 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (­ ¯ãáª ç¥à¥§ ƒ1)
		vsp_long=0;
		Set5024(&vsp_long,slot_au,B_au_MFC1);				//ãáâ ­ ¢«¨¢ ¥¬ ¯®â®ª ƒ1 = 0
		R_Quants=R_Quants & mask_off[6];					//§ ¯¨áë¢ ¥¬ 0 ¢ 6 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (­ ¯ãáª ç¥à¥§ ƒ2)
		vsp_long=0;
		Set5024(&vsp_long,slot_au,B_au_MFC2);				//ãáâ ­ ¢«¨¢ ¥¬ ¯®â®ª ƒ2 = 0
		produv_state=1;										//¤¥« ¥¬ ®â¬¥âªã çâ® ¯à®¤ã¢ § ¢¥àè¥­
		}
}
//-------------------------------- à®æ¥¤ãà  ¯à®æ¥áá  ¯®áâ¥¯¥­­®£® ã¢¥«¨ç¥­¨ï ¯®â®ª  ç¥à¥§ ƒ ¤® § ¤ ­­®£® --------
void napusk_start(void)
{
	if (au_prev_MFC2>au_MFC2)								//¥á«¨ ¯à¥¤ë¤ãé¥¥ §­ ç¥­¨¥ ¡ë«® ¢ëè¥ â¥ªãé¥£® § ¤ ­¨ï 
		{
		vsp_long=au_MFC2;									//â® áà §ã ¢ëáâ ¢«ï¥¬ âà¥¡ã¥¬®£® §­ ç¥­¨¥
		Set5024(&vsp_long,slot_au,B_au_MFC2);				//ãáâ ­ ¢«¨¢ ¥¬ ¯®â®ª ƒ2 = au_MFC2
		au_prev_MFC2=au_MFC2;								//®¡­®¢«ï¥¬ ¯¥à¥¬¥­­ãî "¯à¥¤ë¤ãé¥¥ §­ ç¥­¨¥ ¯®â®ª "
		q_napusk_start.stt=STOP;							//¤¥ ªâ¨¢¨àã¥¬ ¯à®æ¥áá
		}
	else
		{
		if ((au_MFC2-au_prev_MFC2)<=200)					//¥á«¨ ­ã¦­® ã¢¥«¨ç¨âì ¯®â®ª ¬¥­¥¥ ç¥¬ ­  200 ¤¨áªà¥â
			{
			vsp_long=au_MFC2;								//â® áà §ã ¢ëáâ ¢«ï¥¬ âà¥¡ã¥¬®£® §­ ç¥­¨¥
			Set5024(&vsp_long,slot_au,B_au_MFC2);			//ãáâ ­ ¢«¨¢ ¥¬ ¯®â®ª ƒ2 = au_MFC2
			au_prev_MFC2=au_MFC2;							//®¡­®¢«ï¥¬ ¯¥à¥¬¥­­ãî "¯à¥¤ë¤ãé¥¥ §­ ç¥­¨¥ ¯®â®ª "
			q_napusk_start.stt=STOP;						//¤¥ ªâ¨¢¨àã¥¬ ¯à®æ¥áá
			}
		else												//¥á«¨ à §­¨æ  ¡®«ìè¥ ç¥¬ 200 ¤¨áªà¥â
			{
			vsp_long=au_prev_MFC2+200;						
			Set5024(&vsp_long,slot_au,B_au_MFC2);			//â® ¯®¢ëè ¥¬ ¯®â®ª ­  200 ¤¨áªà¥â
			au_prev_MFC2=au_prev_MFC2+200;					//®¡­®¢«ï¥¬ ¯¥à¥¬¥­­ãî "¯à¥¤ë¤ãé¥¥ §­ ç¥­¨¥ ¯®â®ª "
			}
		}
}
//-------------------------------- à®æ¥¤ãà  ¯à®æ¥áá  ®â¯à ¢ª¨ á¨¬¢®«®¢ ç¥à¥§ COM-¯®àâ -------------------
void otpravka_symvolov(void)
{
	int i,j;
	
	if (Shd_enable_flag < 6)								//…á«¨ ¯¥à¢ ï ®â¯à ¢ª  á¨¬¢®«®¢
	{
		if (Shd_enable_flag==5) {							//…á«¨ 4 ®¡à é¥­¨¥ ª ¯à®æ¥¤ãà¥ (0: <LM> 1: DS> 2: FS> 3: - 4: <LM>)
			com_tx('E');
			com_tx('N');
                        com_tx('>');
			Shd_enable_flag++;
			return;
		}
		Shd_enable_flag++;
	}
	
	if (smb_to_send==0)										//¥á«¨ ¡®«ìè¥ ­¥ç¥£® ®â¯à ¢«ïâì
		{
		q_com_tx.stt=STOP;									//¤¥ ªâ¨¢¨àã¥¬ ¯àæ®¥áá ®â¯à ¢ª¨
		R_Quants=R_Quants & mask_off[8];					//§ ¯¨áë¢ ¥¬ 0 ¢ 8 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (®â¯à ¢ª  á¨¬¢®«®¢)
		}
	else													//¨­ ç¥
		{
		i=0;
		while (text_to_send[i]!='>')						//®â¯à ¢«ï¥¬ á¨¬¢®«ë ¢¯«®âì ¤® á¨¬¢®«  > (ª®­¥æ ª®¬ ­¤ë)
			{
			com_tx(text_to_send[i]);
			i++;
			}
		com_tx(text_to_send[i]);							//®â¯à ¢«ï¥¬ á ¬ á¨¬¢®« >
		smb_to_send=smb_to_send-(i+1);						//ã¬¥­ìè ¥¬ ª®«-¢® á¨¬¢®«®¢ ª®â®àë¥ ¥é¥ ­ã¦­® ®â¯à ¢¨âì
		for (j=0;j<smb_to_send;j++)
			text_to_send[j]=text_to_send[i+1+j];			//¯¥à¥§ ¯¨áë¢ ¥¬ ®áâ ¢è¨¥áï á¨¬¢®«ë ¢ ­ ç «® áâà®ª¨
		}
}
//-------------------------------- à®æ¥¤ãà  ¯à®æ¥áá  ¯¥à¥ª«îç¥­¨ï á¨£­ «  ­  ¢å®¤ reset ª®­âà®««¥à  ˜„ ------------
void SMC_reset(void)
{
	du_off(slot_du,B_du_SMC_reset);							//¯¥à¥ª«îç ¥¬ á¨£­ « ¢ ­¨§ª¨© ãà®¢¥­ì ­ ¯àï¦¥­¨ï ¯® ¯à®è¥áâ¢¨¨ 1 á¥ª.
	q_SMC_reset.stt=STOP;									//£ à ­â¨àãï áà ¡ âë¢ ­¨¥ ®¯â®¯ àë ¨ ¯à®ç. âà ­§¨áâ®à®¢, ¤¥ ªâ¨¢¨àã¥¬ ¯à®æ¥áá
}	

//=============================== Žá­®¢­ ï ¯à®£à ¬¬  =====================================================

void main(void)
{
	int i;
	int server_error;
	char shd_current_disable[10]="<LM>DS>FS>",
	
	dispetcher = ACTIV;     							//€ªâ¨¢¨àã¥¬ ¤¨á¯¥âç¥à § ¤ ç
	queue = DONUT;										//®á«¥¤®¢ â¥«ì­®áâì ®¡á«ã¦¨¢ ­¨ï ¯à®æ¥áá®¢ - ¯® ®ç¥à¥¤¨
	for (i=0;i<31;i++) Share_Mem[i]=0;					//Ž¡­ã«¨«¨ ¯ ¬ïâì ®¡¬¥­ 
	
//------------------------------- ˆ­¨æ¨ «¨§ æ¨ï ¬®¤ã«¥© ‹Š ----------------------------------------------	
	v_mask=0;                                   		//0000 0000 0000 0000
	Set5050(&v_mask,slot_du,0,AWord); 					//“áâ ­®¢¨«¨ ­¨§ª¨© ãà®¢¥­ì ­  ª ­ «ë „“

	Init5017H(slot_ac);									//¨­¨æ¨ «¨§¨à®¢ «¨ ¬®¤ã«ì 5017 €Š ‹Š
    High_Speed();       								//¯¥à¥¢¥«¨ ¬®¤ã«ì €Š ¢ à¥¦¨¬ ¡ëáâà®£® áç¥â  ¯®ª § ­¨©

	Init5024(slot_au,0,0,0,0); 							//¨­¨æ¨ «¨§¨à®¢ «¨ ¬®¤ã«ì 5024 €“ ‹Š
														//¨ ãáâ ­®¢¨«¨ ­ã«¥¢ë¥ §­ ç¥­¨ï

//------------------------------- ˆ­¨æ¨ «¨§ æ¨ï COM-¯®àâ®¢ -----------------------------------------------														
	if (com_install(1)==1)							//¥á«¨ ®è¨¡ª  ¨­¨æ¨ «¨§ æ¨¨ ¯®àâ  1
		err_code=err_code | mask_on[5]; 			//§ ¯¨áë¢ ¥¬ 1 ¢ 5 ¡¨â à¥£¨áâà  ®è¨¡®ª "®è¨¡ª  ¨­¨æ¨ «¨§ æ¨¨"
	else err_code=err_code & mask_off[5]; 			//¨­ ç¥ § ¯¨áë¢ ¥¬ 0 ¢ 5 ¡¨â à¥£¨áâà  ®è¨¡®ª
	com_set_speed(57600L);							//ãáâ ­ ¢«¨¢ ¥¬ áª®à®áâì ®¡¬¥­ , ¡®¤
	com_flush_rx();									//®ç¨áâª  ¡ãä¥à  ¯à¨¥¬ 
	com_flush_tx();									//®ç¨áâª  ¡ãä¥à  ¯¥à¥¤ ç¨
	com_set_format(8,2,1);							//ä®à¬ â (¤«¨­  ¤ ­­ëå,ç¥â­®áâì:0-­¥â/1-­¥ç¥â/2-ç¥â,áâ®¯ ¡¨â 1/2) 
	com_raise_dtr();								//ãáâ ­ ¢«¨¢ ¥¬ ¢ëá®ª¨© ãà®¢¥­ì á¨£­ «  DTR
	com_raise_rts(0x3F8);   						//“áâ ­ ¢«¨¢ ¥¬ ¢ëá®ª¨© ãà®¢¥­ì á¨£­ «  RTS §­ ç¥­¨¥ ®¤­®§­. ¤«ï ª®¬ 1

//------------------------------- ˆ­¨æ¨ «¨§ æ¨ï â ©¬¥à®¢ ‹Š ---------------------------------------------
	if (Timer_Init()==1)								//¥á«¨ ®è¨¡ª  ¨­¨æ¨ «¨§ æ¨¨
		err_code=err_code | mask_on[4]; 				//§ ¯¨áë¢ ¥¬ 1 ¢ 4 ¡¨â à¥£¨áâà  ®è¨¡®ª.
	else err_code=err_code & mask_off[4]; 				//¨­ ç¥ § ¯¨áë¢ ¥¬ 0 ¢ 4 ¡¨â à¥£¨áà  ®è¨¡®ª.
	
														//à¨á¢ ¨¢ ¥¬ â ©¬¥à ¯à®æ¥ááã ®âª çª¨
	q_vacuum_start.tm=Timer_Set(1000);  				//à¨á¢ ¨¢ ¥¬ ¨­¤¥ªá â ©¬¥à , ãáâ ­®¢«¥­­®£® ­  1000 ¬á
	q_vacuum_start.stt=STOP;							//Žáâ ­®¢«¨¢ ¥¬ ®¡á«ã¦¨¢ ­¨¥ ¯à®æ¥áá 
	Timer_Reset(q_vacuum_start.tm);						//¥à¥§ ¯ãáª ¥¬ íâ®â â ©¬¥à

	q_vacuum_stop.tm=Timer_Set(1000);					//à¨á¢ ¨¢ ¥¬ â ©¬¥à ¯à®æ¥ááã ®áâ ­®¢ª¨ ®âª çª¨
	q_vacuum_stop.stt=STOP;
	Timer_Reset(q_vacuum_stop.tm);

	q_produv_start.tm=Timer_Set(1000);  				//à¨á¢ ¨¢ ¥¬ â ©¬¥à ¯à®æ¥ááã ¯à®¤ã¢  £ §®¢®© «¨­¨¨
	q_produv_start.stt=STOP;
	Timer_Reset(q_produv_start.tm);

	q_napusk_start.tm=Timer_Set(1000);					//à¨á¢ ¨¢ ¥¬ â ©¬¥à ¯à®æ¥ááã ¯®áâ¥¯¥­­®£® ã¢¥«¨ç¥­¨ï
	q_napusk_start.stt=STOP;							//¯®â®ª  £ §®­ â¥ª ­¨ï ç¥à¥§ ƒ
	Timer_Reset(q_napusk_start.tm);

	q_com_tx.tm=Timer_Set(200);							//à¨á¢ ¨¢ ¥¬ â ©¬¥à ¯à®æ¥ááã ®â¯à ¢ª¨ á¨¬¢®«®¢ 
	q_com_tx.stt=STOP;									//ç¥à¥§ COM-¯®àâ. “áâ ­ ¢«¨¢ ¥¬ ­  200 ¬á.
	Timer_Reset(q_com_tx.tm);
	
	q_SMC_reset.tm=Timer_Set(1000);						//à¨á¢ ¨¢ ¥¬ â ©¬¥à ¯à®æ¥ááã ¯¥à¥ª«îç¥­¨ï á¨£­ « 
	q_SMC_reset.stt=STOP;								//á¡à®á ª®­âà®««¥à  ˜„
	Timer_Reset(q_SMC_reset.tm);
	
														//‘®®¡é¥­¨¥ ®¡ ãá¯¥é­®© ¨­¨æ¨ «¨§ æ¨¨ ¢ í¬ã«ïâ®à â¥à¬¨­ « 
	adv_printf("Timers have been initialized, starting Server...\n");
	
//------------------------------- C®§¤ ­¨¥ á¥à¢¥à  TCP ---------------------------------------------------
											
	server_error=ADAMTCP_ModServer_Create(502, 200, 2, (unsigned char *)Share_Mem, sizeof(Share_Mem));
											
														//¯à¨á¢ ¨¢ ¥¬ «®ª «ì­®© ¯¥à¥¬¥­­®© ª®¤ ®è¨¡ª¨ ¨­¨æ¨ «¨§ æ¨¨
														//¯ à ¬¥âàë: (ü ¯®àâ , time-out[¬á], ª®«-¢® ª«¨¥­â®¢, ¯ ¬ïâì ®¡¬¥­ )
													
	adv_printf("error code is %d\n", server_error);		//‘®®¡é¥­¨¥ á ª®¤®¬ ®è¨¡ª¨ ¢ í¬ã«ïâ®à â¥à¬¨­ « 
	adv_printf("Server started, wait for connect...\n");

	do													//Ž¦¨¤ ¥¬
	{}
	while(ADAMTCP_ModServer_Update() != 1); 			//¯®ª  ­¥ ¯à®¨§®©¤¥â ¯¥à¢®¥ ®¡à é¥­¨¥ ª«¨¥­â 
	
	adv_printf("First contact has been approached, running dispetcher...\n");
	
//------------------------------- ˆ­¨æ¨¨àã¥¬ ¢ëª«îç¥­¨¥ ®¡¬®â®ª ¤¢¨£ â¥«ï  -------------------------------

	R_Quants=R_Quants | mask_on[8];					//§ ¯¨áë¢ ¥¬ 1 ¢ 8 ¡¨â à¥£¨áâà  á®áâ®ï­¨ï ¯à®æ¥áá®¢ (®â¯à ¢ª  á¨¬¢®«®¢)
	q_com_tx.stt=START;								// ªâ¨¢¨àã¥¬ ¯à®æ¥áá ®â¯à ¢ª¨ á¨¬¢®«®¢ ç¥à¥§ COM-¯®àâ
	pattern_writer(0,10,shd_current_disable);		//§ ¯¨áë¢ ¥¬ ¢ ¡ãä¥à 10 á¨¬¢®«®¢ <LM>DS>FS> á ­ã«¥¢®£®
	smb_to_send=10;									//§ ¯¨áë¢ ¥¬ ¢ ¯¥à¥¬¥­­ãî ¨â®£®¢ãî ¤«¨­ã ¡ãä¥à 
	
	
//------------------------------- ‡ ¯ãáª ¥¬ ¤¨á¯¥âç¥à ¯à®æ¥áá®¢ ------------------------------------------
	DISP:
//------------------------------- ˆ­â¥à¯à®æ¥áá -----------------------------------------------------------	
		if (ADAMTCP_ModServer_Update())					//…á«¨ ¡ë«® ®¡à é¥­¨¥ ª«¨¥­â  ¨ ¢ à¥£¨áâà æ¨ª« 
		if (Share_Mem[20] != 0)							//¡ë«® § ¯¨á ­® §­ ç¥­¨¥ (¡ë« æ¨ª« § ¯¨á¨ ã ª«¨¥­â ),
			server_update(); 							//â® ®¡­®¢«ï¥¬ á¥à¢¥à (á¥©ç á ã ª«¨¥­â  æ¨ª« çâ¥­¨ï)
														
//------------------------------- ‘¨­åà®¯à®æ¥ááë ¢ ¯®àï¤ª¥ ¯à¨®à¨â¥â­®áâ¨ --------------------------------
		if (q_vacuum_start.stt==START)           		//…á«¨ § ¯ãé¥­ ¯à®æ¥áá ®âª çª¨
		if (tmArriveCnt[q_vacuum_start.tm]!=0)			//ˆ áà ¡®â « â ©¬¥à ¯à®æ¥áá  
			{
			vacuum_start();								//®¡á«ã¦¨¢ ¥¬ ¯à®æ¥áá ®âª çª¨
			Timer_Reset(q_vacuum_start.tm); 			//¯¥à¥§ ¯ãáª ¥¬ â ©¬¥à ¯à®æ¥áá 
			if (queue==PRIORY) goto DISP;				//¢®§¢à é ¥¬áï ¢ ­ ç «® á¯¨áª , ¥á«¨
			}											//¯®á«¥¤®¢ â¥«ì­®áâì ®¡á«ã¦¨¢ ­¨ï ¯à¨®à¨â¥â­ ï

		if (q_vacuum_stop.stt==START)            		//à®æ¥áá ®áâ ­®¢ª¨ ®âª çª¨
		if (tmArriveCnt[q_vacuum_stop.tm]!=0)
			{
			vacuum_stop();
			Timer_Reset(q_vacuum_stop.tm);
			if (queue==PRIORY) goto DISP;				
			}
	
		if (q_produv_start.stt==START)           		//à®æ¥áá ¯à®¤ã¢  £ §®¢®© «¨­¨¨
		if (tmArriveCnt[q_produv_start.tm]!=0)
			{
			produv_start();
			Timer_Reset(q_produv_start.tm);
			if (queue==PRIORY) goto DISP;
			}
		
		if (q_napusk_start.stt==START)          		//à®æ¥áá ã¢¥«¨ç¥­¨ï ¯®â®ª  £ §  ç¥à¥§ ƒ
		if (tmArriveCnt[q_napusk_start.tm]!=0)
			{
			napusk_start();
			Timer_Reset(q_napusk_start.tm);
			if (queue==PRIORY) goto DISP;
			}
		
	    if (q_com_tx.stt==START)						//à®æ¥áá ®â¯à ¢ª¨ á¨¬¢®«®¢ ç¥à¥§ COM-¯®àâ
		if (tmArriveCnt[q_com_tx.tm]!=0)
			{
			otpravka_symvolov();
			Timer_Reset(q_com_tx.tm);
			if (queue==PRIORY) goto DISP;
			}
			
		if (q_SMC_reset.stt==START)						//à®æ¥áá ¯¥à¥ª«îç¥­¨ï á¨£­ «  á¡à®á ª®­âà®««¥à  ˜„
		if (tmArriveCnt[q_SMC_reset.tm]!=0)
			{
			SMC_reset();
			Timer_Reset(q_SMC_reset.tm);
			if (queue==PRIORY) goto DISP;
			}
		
		if (dispetcher==ACTIV) goto DISP;				//¢®§¢à é ¥¬áï ¢ ­ ç «® ¨«¨ ¢ëå®¤¨¬ ¨§ ¤¨á¯¥âç¥à 
														//¨ § ¢¥àè ¥¬ à ¡®âã

	ADAMTCP_ModServer_Release();						//§ ¢¥àè¥­¨¥ à ¡®âë á¥à¢¥à  TCP
	com_deinstall();									//§ ¢¥àè¥­¨¥ à ¡®âë COM-¯®àâ 
	Release_All();										//§ ¢¥àè¥­¨¥ à ¡®âë ¯à®£à ¬¬ë
}	
